Repository: lockhart39/HueQualityAndIngestionApp
Catalog: apps/jobbrowser/src/jobbrowser/locale/*/LC_MESSAGES/django.po
Languages: pt

source: Share submitted jobs information with all users. If set to false, submitted jobs are visible only to the owner and administrators.
pt: Partilhar informação de trabalhos enviados com todos os utilizadores. Se definido como False, os trabalhos enviados serão visíveis apenas pelo proprietário e pelos administradores.

source: Could not find job with id %(jobid)s.
pt: Não foi possível encontrar o trabalho com o ID %(jobid)s.

source: Cannot look up TaskTracker %(id)s.
pt: Não é possível consultar o TaskTracker %(id)s.

source: Cannot retrieve logs from TaskTracker %(id)s.
pt: Não foi possível recuperar os registos do TaskTracker %(id)s.

source: Hue encountered an error while retrieving logs from '%s'.
pt: A Hue encontrou um erro ao recuperar os registos de "%s".

source: Job %s has expired.
pt: O job %s expirou.

source: Cannot be found on the History Server.
pt: Não encontrado no History Server.

source: You don't have permission to access job %(id)s.
pt: Não tem permissão para aceder ao trabalho %(id)s.

source: Error polling job %s: %s
pt: Erro na sondagem do trabalho %s: %s

source: Resource Manager cannot be contacted or might be down.
pt: Não é possível comunicar com o Resource Manager ou este pode não estar a funcionar.

source: Job Tracker cannot be contacted or might be down.
pt: Não é possível comunicar com o Job Tracker ou este pode não estar a funcionar.

source: kill_job may only be invoked with a POST (got a %(method)s).
pt: kill_job pode ser invocado apenas com um POST (tem um %(method)s).

source: Insufficient permission
pt: Permissão insuficiente

source: Permission denied. User %(username)s cannot delete user %(user)s's job.
pt: Permissão recusada. O utilizador %(username)s não pode eliminar um trabalho do utilizador %(user)s.

source: Job did not appear as killed within 15 seconds.
pt: O trabalho não apareceu como eliminado no período de 15 segundos.

source: Cannot find job attempt '%(id)s'.
pt: Não é possível encontrar a tentativa de job "%(id)s".

source: Failed to retrieve log: %s
pt: Não foi possível obter o registo: %s

source: No tasks found for job %(id)s.
pt: Nenhuma tarefa encontrada para o trabalho %(id)s.

source: Cannot find attempt '%(id)s' in task
pt: Não é possível encontrar a tentativa "%(id)s" na tarefa

source: Failed to retrieve log. TaskTracker not found.
pt: Falha ao recuperar o registo. TaskTracker não encontrado.

source: Failed to retrieve log. TaskTracker not ready.
pt: Falha ao obter registo. TaskTracker não pronto.

source: The tracker could not be contacted.
pt: Não foi possível contactar o tracker.

source: The container disappears as soon as the job finishes.
pt: O contentor desaparece assim que o trabalho termina.

source: Failed Tasks
pt: Tarefas falhadas

source: Logs
pt: Registos

source: Task Attempt: %(attemptId)s
pt: Tentativa de tarefa: %(attemptId)s

source: Attempt ID
pt: ID de tentativa

source: Task
pt: Tarefa

source: Status
pt: Estado

source: Metadata
pt: Metadados

source: Counters
pt: Contadores

source: Name
pt: Nome

source: Value
pt: Valor

source: Task ID
pt: ID da tarefa

source: View this task
pt: Ver esta tarefa

source: Task Type
pt: Tipo de tarefa

source: JobId
pt: ID do trabalho

source: View this job
pt: Ver este trabalho

source: State
pt: Estado

source: Start Time
pt: Hora de início

source: Finish Time
pt: Hora de fim

source: Progress
pt: Progresso

source: Phase
pt: Fase

source: Output Size
pt: Tamanho de saída

source: Shuffle Finish
pt: Aleatorizar o fim

source: Sort Finish
pt: Ordenar o fim

source: Map Finish
pt: Mapear o fim

source: No data available
pt: Não existem dados disponíveis

source: No matching records
pt: Não existem registos correspondentes

source: task diagnostic log
pt: registo de diagnóstico de tarefa

source: Container: %(trackerId)s
pt: Contentor: %(trackerId)s

source: Container at %(trackerHost)s on port %(trackerPort)s
pt: Contentor em %(trackerHost)s na porta %(trackerPort)s

source: Memory Metrics
pt: Métricas de memória

source: Node Id
pt: ID do nó

source: User
pt: Utilizador

source: Diagnostics
pt: Diagnóstico

source: Total Memory Needed in MB
pt: Memória total necessária em MB

source: Exit Code
pt: Código de saída

source: Back
pt: Voltar

source: Tasks
pt: Tarefas

source: Type
pt: Tipo

source: Job: %(jobId)s
pt: Trabalho: %(jobId)s

source: App ID
pt: ID de aplicação

source: Duration
pt: Duração

source: Actions
pt: Acções

source: Metrics
pt: Métricas

source: Host
pt: Anfitrião

source: Queue Name
pt: Nome da fila

source: Started
pt: Iniciado

source: Finished
pt: Concluído

source: Pre-empted Resource VCores
pt: VCores de recurso interrompidos

source: VCore seconds
pt: Segundos VCore

source: Memory seconds
pt: Segundos de memória

source: Job ID
pt: ID de job

source: Output
pt: Saída

source: Attempts
pt: Tentativas

source: Container
pt: Contentor

source: This jobs is
pt: Este job está

source: retired
pt: terminado

source: and so has little information available.
pt: , pelo que tem pouca informação disponível.

source: View All Failed Tasks
pt: Ver todas as tarefas falhadas

source: View All Tasks
pt: Ver todas as tarefas

source: Recent Tasks
pt: Tarefas recentes

source: Text Filter
pt: Filtro de texto

source: Ended
pt: Finalizado

source: Raw configuration:
pt: Configuração não processada:

source: Confirm Kill
pt: Confirmar eliminação

source: Are you sure you want to kill this job?
pt: Tem certeza de que pretende eliminar este trabalho?

source: No
pt: Não

source: Yes
pt: Sim

source: There was a problem communicating with the server. Refresh the page.
pt: Ocorreu um problema ao comunicar com o servidor. Actualize a página.

source: Kill this job
pt: Eliminar este job

source: Retired
pt: Terminado

source: There was a problem killing this job.
pt: Ocorreu um problema ao eliminar este job.

source: Job Attempt: %(attempt_index)s
pt: Tentativa de trabalho: %(attempt_index)s

source: Attempt: %(attempt_index)s
pt: Tentativa: %(attempt_index)s

source: Loading...
pt: A carregar...

source: The application might not be running yet or there is no Node Manager or Container available.
pt: A aplicação pode não estar ainda a ser executada ou não existir nenhum Node Manager ou contentor disponível.

source: This page will be automatically refreshed.
pt: Esta página será automaticamente actualizada.

source: Counter Name
pt: Nome de contador

source: Maps Total
pt: Total de maps

source: Reduces Total
pt: Total de reduces

source: Username
pt: Nome de utilizador

source: Search for username
pt: Pesquisar por nome de utilizador

source: Text
pt: Texto

source: Search for text
pt: Pesquisar por texto

source: Show retired jobs
pt: Mostrar jobs terminados

source: Succeeded
pt: Bem-sucedido

source: Running
pt: Em execução

source: Failed
pt: Falhou

source: Killed
pt: Eliminado

source: There are no jobs that match your search criteria.
pt: Nenhum trabalho corresponde aos seus critérios de pesquisa.

source: Queue
pt: Fila

source: Priority
pt: Prioridade

source: Submitted
pt: Enviado

source: There was a problem communicating with the server:
pt: Ocorreu um problema ao comunicar com o servidor:

source: Kill
pt: Eliminar

source: Job Task: %(taskId)s
pt: Tarefa do job: %(taskId)s

source: End Time
pt: Hora de fim

source: View this attempt
pt: Visualizar esta tentativa

source: Task id
pt: ID da tarefa

source: Execution Start Time
pt: Hora de início da execução

source: Execution Finish Time
pt: Hora de fim da execução

source: Task View: Job: %(jobId)s
pt: Vista de tarefa: Trabalho: %(jobId)s

source: Filter tasks:
pt: Filtrar tarefas:

source: All states
pt: Todos os estados

source: succeeded
pt: bem-sucedido

source: running
pt: em execução

source: failed
pt: falhou

source: killed
pt: eliminado

source: pending
pt: pendente

source: All types
pt: Todos os tipos

source: cleanups
pt: limpezas

source: setups
pt: configurações

source: Text filter
pt: Filtro de texto

source: View Attempts
pt: Visualizar tentativas

source: Show only %(state)s tasks
pt: Mostrar apenas tarefas %(state)s

source: Tracker at %(trackerHost)s on port %(trackerPort)s
pt: Tracker em %(trackerHost)s na porta %(trackerPort)s

source: Last heard from at
pt: Última comunicação às

source: Total virtual memory:
pt: Memória virtual total:

source: Total physical memory:
pt: Memória física total:

source: Available space:
pt: Espaço disponível:

source: Map and Reduce
pt: Map e Reduce

source: Map count:
pt: Número de maps:

source: Reduce count:
pt: Número de reduces:

source: Max map tasks:
pt: Máximo de tarefas de map:

source: Max reduce tasks:
pt: Máximo de tarefas de reduce:

source: Port
pt: Porta

source: Last Seen
pt: Última visualização

source: Available Space
pt: Espaço disponível

source: Failure Count
pt: Número de falhas

source: Map Count
pt: Número de maps

source: Reduce Count
pt: Número de reduces

source: Max Map Tasks
pt: Máx. de tarefas de Map:

source: Max Reduce Tasks
pt: Máximo de tarefas de Reduce:

source: No time
pt: Sem hora
