Repository: lockhart39/HueQualityAndIngestionApp
Catalog: apps/beeswax/src/beeswax/locale/*/LC_MESSAGES/django.po
Languages: pt

source: A POST request is required.
pt: É necessário um pedido POST.

source: There was an error with your query.
pt: Ocorreu um erro com a sua consulta.

source: A GET request is required.
pt: É necessário um pedido GET.

source: This query is %(state)s. Results unavailable.
pt: Esta consulta é %(state)s. Resultados indisponíveis.

source: The result could not be saved: %s.
pt: Não foi possível guardar o resultado: %s.

source: Cannot find query handle and state: %s
pt: Não é possível encontrar o handle e o estado da consulta: %s

source: The target path is a directory
pt: O caminho alvo é um directório

source: Problem accessing table metadata
pt: Problema ao aceder aos metadados da tabela

source: No databases are available. Permissions could be missing.
pt: Não estão disponíveis bases de dados. Podem estar em falta permissões.

source: Host where HiveServer2 server is running. If Kerberos security is enabled, the fully-qualified domain name (FQDN) is required
pt: Anfitrião onde o servidor HiveServer2 está a ser executado. Se a segurança Kerberos estiver activada, é necessário o nome de domínio completamente qualificado (FQDN)

source: Configure the port the HiveServer2 server runs on.
pt: Configurar a porta onde o servidor HiveServer2 é executado.

source: Hive configuration directory, where hive-site.xml is located.
pt: Directório de configuração do Hive, onde se encontra o ficheiro hive-site.xml.

source: Path to HiveServer2 start script
pt: Caminho para o script de início HiveServer2

source: The local filesystem path containing the Hive examples.
pt: O caminho do sistema de ficheiros local que contém exemplos do Hive.

source: Timeout in seconds for Thrift calls.
pt: Limite de tempo em segundos para chamadas Thrift.

source: Hue will try to close the Hive query when the user leaves the editor page. This will free all the query resources in HiveServer2, but also make its results inaccessible.
pt: O Hue tentará fechar a consulta Hive quando o utilizador deixar a página de editor. Isso irá libertar todos os recursos de consulta no HiveServer2, mas também tornará os seus resultados inacessíveis.

source: SSL configuration for the server.
pt: Configuração SSL para o servidor.

source: Path to Certificate Authority certificates.
pt: Caminho para certificados de autoridade de certificação.

source: Choose whether Hue should validate certificates received from the server.
pt: Decida se o Hue deve validar certificados recebidos a partir do servidor.

source: tabs
pt: tabulações

source: commas
pt: vírgulas

source: spaces
pt: espaços

source: Invalid form submission
pt: Envio de formulário inválido

source: The selected delimiter is creating an un-even number of columns. Please make sure you don't have empty columns.
pt: O delimitador seleccionado está a criar um número assimétrico de colunas. Certifique-se de que não tem colunas vazias.

source: Internal error when constructing the delimiter form: %(error)s.
pt: Erro interno ao construir o formulário do delimitador: %(error)s.

source: Failed to decode file '%(path)s' into printable characters under %(encoding)s.
pt: Fala ao descodificar o ficheiro "%(path)s" em caracteres que podem ser impressos na %(encoding)s.

source: Could not find any columns to import
pt: Não foi possível encontrar colunas a importar

source: Failed to open file '%(path)s': %(error)s.
pt: Falha ao abrir o ficheiro '%(path)s': %(error)s.

source: Internal error: Missing needed parameter to load data into table.
pt: Erro interno: Parâmetro necessário para carregar dados na tabela em falta.

source: %s already exists.
pt: %s já existe.

source: Change the name to save as a new design.
pt: Altere o nome para guardar como um novo design.

source: Description
pt: Descrição

source: Save
pt: Guardar

source: Save As
pt: Guardar como

source: Enter a name.
pt: Introduza um nome.

source: Directory
pt: Directório

source: Path to directory
pt: Caminho para o directório

source: Target directory should begin with a /
pt: O directório-alvo deve começar por a /

source: Directory already exists.
pt: O directório já existe.

source: File path
pt: Caminho do ficheiro

source: Path to file
pt: Caminho para o ficheiro

source: Overwrite
pt: Sobrepor

source: Overwrite the selected files
pt: Substituir os ficheiros seleccionados

source: Table Name
pt: Nome da tabela

source: Name of the new table
pt: Nome da nova tabela

source: Query Editor
pt: Editor de consultas

source: archive
pt: ficheiro

source: Resources to upload with your Hive job. Use 'jar' for UDFs. Use 'file' and 'archive' for files to be copied and made locally available during MAP/TRANSFORM. Paths are on HDFS.
pt: Recursos para upload com o seu trabalho no Hive. Utilize "jar" para UDFs. Utilize "file" e "archive" para copiar ficheiros e torná-los disponíveis localmente durante operações MAP/TRANSFORM. Os caminhos pertencem ao HDFS.

source: Path to file on HDFS.
pt: Caminho para ficheiro no HDFS.

source: Field terminator
pt: Terminador de campo

source: Collection terminator
pt: Terminador de colecção

source: Map key terminator
pt: Terminador de chave de map

source: SerDe Name
pt: Nome SerDe

source: Comma-separated list of key-value pairs. E.g. 'p1=v1, p2=v2'
pt: Lista separada por vírgulas de pares chave-valor. P. ex.: "p1=v1, p2=v2"

source: InputFormat Class
pt: Classe InputFormat

source: OutputFormat Class
pt: Classe OutputFormat

source: Use default location.
pt: Utilizar localização predefinida.

source: Path to HDFS directory or file of table data.
pt: Caminho para o directório HDFS ou ficheiro de dados da tabela.

source: Table "%(name)s" already exists.
pt: A tabela "%(name)s" já existe.

source: Terminator must not be empty.
pt: O terminador não pode estar vazio.

source: Delimiter
pt: Delimitador

source: Delimiter value must be smaller than 65533.
pt: O valor do delimitador deve ser menor do que 65533.

source: Delimiter value is required.
pt: O valor do delimitador é necessário.

source: Column Name
pt: Nome da coluna

source: Column Type
pt: Tipo de coluna

source: Array Value Type
pt: Tipo de valor Array

source: Specify if column_type is map.
pt: Especificar se column_type for map.

source: Add a column
pt: Adicionar uma coluna

source: Add a partition
pt: Adicionar uma partição

source: Database "%(name)s" already exists.
pt: A base de dados "%(name)s" já existe.

source: Database Name
pt: Nome da base de dados

source: Use default location
pt: Utilizar a localização predefinida

source: Path to HDFS directory or file of database data.
pt: Caminho para o directório HDFS ou ficheiro de dados da base de dados.

source: Host of the query server.
pt: Anfitrião do servidor de consultas.

source: Port of the query server.
pt: Porta do servidor de consultas.

source: Name of the query server.
pt: Nome do servidor de consultas.

source: Type of the query server.
pt: Tipo do servidor de consultas.

source: Type of the query.
pt: Tipo de consultas.

source: My saved query
pt: A minha consulta guardada

source: (new)
pt: (novo)

source: Is trashed
pt: Está no lixo

source: If this query is trashed.
pt: Se esta consulta for enviada para o lixo.

source: Cannot retrieve query id %(id)s.
pt: Não é possível obter a ID de consulta %(id)s.

source: Query id %(id)s does not belong to user %(user)s.
pt: A ID de consulta %(id)s não pertence ao utilizador %(user)s.

source: Type mismatch for design id %(id)s (owner %(owner)s) - Expected %(expected_type)s, got %(real_type)s.
pt: Erro de correspondência para a ID de design %(id)s (proprietário %(owner)s) - Esperado %(expected_type)s, obteve %(real_type)s.

source: Last used
pt: Última utilização

source: Application we communicate with.
pt: Aplicação com que comunicamos

source: Invalid design type %(type)s
pt: Tipo de design inválido %(type)s

source: Delete design(s)?
pt: Eliminar design(s)?

source: Restore design(s)?
pt: Restaurar design(s)?

source: Copied design: %(name)s
pt: Design copiado: %(name)s

source: Beeswax query completed.
pt: Consulta Beeswax concluída.

source: Design %(id)s does not exist.
pt: O design %(id)s não existe.

source: QueryHistory %(id)s does not exist.
pt: O histórico de consultas %(id)s não existe.

source: Permission denied to read QueryHistory %(id)s
pt: Permissão negada para ler o histórico de consultas %(id)s

source: Failed to retrieve query state from the Query Server.
pt: Falha ao obter o estado da consulta do Query Server.

source: Failed to contact Server to check query status.
pt: Falha ao contactar o servidor para verificar o estado da consulta.

source: SQL table examples already installed.
pt: Exemplos de tabela SQL já instalados.

source: Permission denied. Please check with your system administrator.
pt: Permissão negada. Verifique junto do administrador do sistema.

source: Could not install table: %s
pt: Não foi possível instalar a tabela: %s

source: Could not install query: %s
pt: Não foi possível instalar a consulta: %s

source: Table "%(table)s" already exists.
pt: A tabela "%(table)s" já existe.

source: Error creating table %(table)s: Operation timeout.
pt: Erro ao criar a tabela %(table)s: limite de tempo de operação.

source: Error creating table %(table)s: %(error)s.
pt: Erro ao criar a tabela %(table)s: %(error)s.

source: Cannot find table data in "%(file)s".
pt: Não é possível encontrar os dados da tabela em "%(file)s".

source: Error loading table %(table)s: Operation timeout.
pt: Erro ao carregar a tabela %(table)s: limite de tempo de operação.

source: Error loading table %(table)s: %(error)s.
pt: Erro ao carregar a tabela %(table)s: %(error)s.

source: Only SELECT statements can be saved. Provided query: %(query)s
pt: Apenas instruções SELECT podem ser guardadas. Consulta fornecida: %(query)s

source: Saved query results as new table %(table)s.
pt: Resultados da consulta guardados como uma nova tabela %(table)s.

source: Server returning invalid handle for query id %(id)d [%(query)s]...
pt: O servidor está a devolver um handle inválido para a ID de consulta %(id)d [%(query)s]...

source: Could not retrieve logs: %s.
pt: Não foi possível obter registos: %s.

source: Unknown exception.
pt: Excepção desconhecida.

source: %s server authentication not supported. Valid are %s.
pt: Autenticação do servidor %s não suportada. Válidos são %s.

source: Beginning of List
pt: Início da lista

source: Previous Page
pt: Página anterior

source: Next page
pt: Página seguinte

source: Next Page
pt: Página seguinte

source: End of List
pt: Fim da lista

source: Showing %(start)s to %(end)s of %(count)s items, page %(page)s of %(pages)s
pt: %(start)s a %(end)s de %(count)s itens, página %(page)s de %(pages)s

source: Settings
pt: Definições

source: Clear
pt: Limpar

source: Key
pt: Chave

source: Value
pt: Valor

source: No data available
pt: Não existem dados disponíveis

source: No matching records
pt: Não existem registos correspondentes

source: Confirm action
pt: Confirmar acção

source: Yes
pt: Sim

source: No
pt: Não

source: Create database
pt: Criar base de dados

source: Create a new database
pt: Criar uma nova base de dados

source: Step 1: Name
pt: Passo 1: Nome

source: Step 2: Location
pt: Passo 2: localização

source: Create a database
pt: Criar uma base de dados

source: Let's start with a name and description for where we'll store your data.
pt: Comecemos pelo nome e pela descrição do local onde guardaremos os seus dados.

source: This field is required. Spaces are not allowed.
pt: O campo é obrigatório. Espaços não são permitidos.

source: Name of the new database. Database names must be globally unique. Database names tend to correspond to the directory where the data will be stored.
pt: Nome da nova base de dados. Os nomes de base de dados devem ser globalmente únicos. Os nomes de base de dados tendem a corresponder ao directório onde os dados serão armazenados.

source: Optional
pt: Opcional

source: Use a database comment to describe the database. For example, note the data's provenance and any caveats users need to know.
pt: Use um comentário de base de dados para descrever a base de dados. Por exemplo, anote a procedência dos dados e quaisquer advertências que os utilizadores precisem de saber.

source: Choose Where Your Database's Data is Stored
pt: Escolha onde os dados da sua base de dados ficarão armazenados

source: Location
pt: Localização

source: Store your database in the default location (controlled by Hive, and typically
pt: Guarde a sua base de dados na localização predefinida (controlada pelo Hive e, tipicamente

source: This field is required.
pt: Este campo é obrigatório.

source: Enter the path (on HDFS) to your database's data location.
pt: Insira o caminho (no HDFS) para a localização dos dados da sua base de dados.

source: Back
pt: Voltar

source: Next
pt: Seguinte

source: Choose a file
pt: Escolha um ficheiro

source: There was a problem loading the table preview.
pt: Ocorreu um problema ao carregar a pré-visualização da tabela.

source: Create table manually
pt: Criar tabela manualmente

source: Create a new table from a file
pt: Criar uma nova tabela a partir de um ficheiro

source: Databases
pt: Bases de dados

source: Create a new table manually
pt: Criar uma nova tabela manualmente

source: Step 2: Record Format
pt: Passo 2: Formato dos registos

source: Step 3: Serialization
pt: Passo 3: Serialização

source: Step 4: File Format
pt: Passo 4: Formato do ficheiro

source: Step 5: Location
pt: Passo 5: localização

source: Step 6: Columns
pt: Passo 6: colunas

source: Create a table
pt: Criar uma tabela

source: Name of the new table. Table names must be globally unique. Table names tend to correspond to the directory where the data will be stored.
pt: Nome da nova tabela. Os nomes de tabela devem ser globalmente únicos. Os nomes de tabela tendem a corresponder aos directórios onde os dados serão armazenados.

source: Use a table comment to describe your table. For example, note the data's provenance and any caveats users need to know.
pt: Use um comentário de tabela para descrever a sua tabela. Por exemplo, anote a procedência dos dados e quaisquer advertências que os utilizadores precisem de saber.

source: Choose Your Record Format
pt: Escolha o formato dos registos

source: Individual records are broken up into columns either with delimiters (e.g., CSV or TSV) or using a specific serialization/deserialization (SerDe) implementation. (One common specialized SerDe is for parsing out columns with a regular expression.)
pt: Os registos individuais são quebrados em colunas com delimitadores (por exemplo, CSV ou TSV) ou usando uma implementação de serialização/desserialização (SerDe) específica. (Um SerDe especializado comum é utilizado para análise de colunas com uma expressão regular).

source: Record format
pt: Formato do registo

source: Delimited
pt: Delimitado

source: (Data files use delimiters, like commas (CSV) or tabs.)
pt: (Os ficheiros de dados utilizam delimitadores, como vírgulas (CSV) ou tabulações.)

source: (Enter a specialized serialization implementation.)
pt: (Introduza uma implementação de serialização especializada.)

source: Configure Record Serialization
pt: Configurar a serialização dos registos

source: Only supports single-character delimiters.
pt: Suporta apenas delimitadores de um só carácter.

source: Enter the column delimiter. Must be a single character. Use syntax like "\001" or " " for special characters.
pt: Introduza um delimitador de coluna. Tem de ter apenas um carácter. Utilize uma sintaxe do tipo "\001" ou " " para caracteres especiais.

source: Use for array types.
pt: Utilizar para tipos Array.

source: Use for map types.
pt: Utilizar para tipos Map.

source: The Java class name of your SerDe.
pt: O nome da classe de Java do seu SerDe.

source: e.g.
pt: por exemplo

source: Properties to pass to the (de)serialization mechanism.
pt: Propriedades a passar ao mecanismo de (des)serialização.

source: Choose a File Format
pt: Escolha um formato de ficheiro

source: Use
pt: Utilizador

source: for newline-delimited text files.
pt: para ficheiros de texto delimitados com newline.

source: for Hadoop's binary serialization format.
pt: para o formato de serialização binária do Hadoop.

source: to choose a custom implementation.
pt: para escolher uma implementação personalizada.

source: File format
pt: Formato de ficheiro

source: Java class used to read data.
pt: Classe Java usada para ler dados.

source: Java class used to write data.
pt: Classe Java usada para escrever dados.

source: Choose Where Your Table's Data is Stored
pt: Seleccionar onde os dados da sua tabela são armazenados

source: Store your table in the default location (controlled by Hive, and typically
pt: Guarde a sua tabela na localização predefinida (controlada pelo Hive e, tipicamente

source: Enter the path (on HDFS) to your table's data location
pt: Insira o caminho (no HDFS) para a localização dos dados da tabela

source: Configure Table Columns
pt: Configurar as colunas da tabela

source: Configure Partitions
pt: Configurar as partições

source: If your data is naturally partitioned (by date, for example), partitions are a way to tell the query server that data for a specific partition value are stored together.
pt: Se os seus dados estiverem naturalmente em partições (por exemplo, por data), as partições são uma forma de informar o servidor de consulta de que os dados de um determinado valor de partição estão armazenados em conjunto.

source: The query server establishes a mapping between directories on disk
pt: O servidor de consulta estabelece um mapeamento entre os directórios no disco

source: and the data for that day. Partitions are virtual columns; they are not represented in the data itself, but are determined by the data location. The query server implements query optimizations such that queries that are specific to a single partition need not read the data in other partitions.
pt: e os dados para esse dia. As partições são colunas virtuais; não estão representadas nos próprios dados, mas são determinadas pela localização dos dados. O servidor de consulta implementa optimizações de consultas de forma a que as consultas que digam respeito a uma única partição não obriguem a leitura de dados de outras partições.

source: Create table
pt: Criar tabela

source: Delete this column
pt: Eliminar esta coluna

source: Column name
pt: Nome da coluna

source: There is another field with the same name.
pt: Existe outro campo com o mesmo nome.

source: Column name must be single words that start with a letter or a digit.
pt: O nome da coluna deve ser composto por palavras simples que comecem com uma letra ou um dígito.

source: Column type
pt: Tipo de coluna

source: Type for this column. Certain advanced types (namely, structs) are not exposed in this interface.
pt: Tipo desta coluna. Alguns tipos avançados (nomeadamente estruturas) não estão expostos nesta interface.

source: Array value type
pt: Tipo de valor em array

source: Type of the array values.
pt: Tipo de valores em array.

source: Map Key type
pt: Tipo de chave de map

source: Type of the map keys.
pt: Tipo das chaves de map.

source: Map Value type
pt: Tipo do valor do map

source: Type of the map values.
pt: Tipo de valores do map.

source: Type your field terminator here
pt: Digite o finalizador de campo aqui

source: Type your collection terminator here
pt: Digite o finalizador de coleção aqui

source: Type your map key terminator here
pt: Digite o finalizador da chave de map aqui

source: Query
pt: Consultar

source: settings
pt: definições

source: Delete this setting
pt: Eliminar esta configuração

source: Add
pt: Adicionar

source: File Resources
pt: Recursos de ficheiro

source: Type
pt: Tipo

source: file
pt: ficheiro

source: Path
pt: Caminho

source: User-Defined Functions
pt: Funções definidas pelo utilizador

source: Name
pt: Nome

source: Class name
pt: Nome da classe

source: Options
pt: Opções

source: If checked (the default), you can include parameters like $parameter_name in your query, and users will be prompted for a value when the query is run.
pt: Se marcado (predefinição), poderá incluir parâmetros como $parameter_name na sua consulta e um valor será pedido aos utilizadores quando a consulta for executada.

source: Enable parameterization
pt: Activar parametrização

source: Metastore Catalog
pt: Catálogo Metastore

source: Sync tables tips
pt: Dicas de sincronização de tabelas

source: invalidates the entire catalog metadata. All table metadata will be reloaded on the next access.
pt: invalida todos os metadados de catálogo. Todos os metadados de tabela serão recarregados no próximo acesso.

source: invalidates the metadata, load on the next access
pt: invalida os metadados, carregamento no próximo acesso.

source: refreshes the metadata immediately. It is a faster, incremental refresh.
pt: actualiza os metadados imediatamente. É uma actualização mais rápida, incremental.

source: This query had some sensitive information removed when saved.
pt: Removeu-se informação sensível desta consulta ao guardá-la.

source: Press CTRL + Space to autocomplete
pt: Prima CTRL + Espaço para concluir automaticamente

source: You can execute queries with multiple SQL statements delimited by a semicolon ';'
pt: Pode executar consultas com várias instruções SQL delimitadas por ";"

source: You can highlight and run a fragment of a query
pt: Pode realçar e executar um fragmento de uma consulta

source: Query name
pt: Nome da consulta

source: Query description
pt: Descrição da consulta

source: Please provide a query
pt: Forneça uma consulta

source: Your query has the following error(s):
pt: A sua consulta tem o(s) seguinte(s) erro(s):

source: Execute
pt: Executar

source: Canceling...
pt: A cancelar...

source: Cancel the query
pt: Cancelar a consulta

source: Cancel
pt: Cancelar

source: Restart
pt: Reiniciar

source: Save as...
pt: Guardar como...

source: Explain
pt: Explicar

source: or create a
pt: ou criar uma

source: New query
pt: Nova consulta

source: See results in full screen
pt: Ver resultados em ecrã inteiro

source: Save the results to HDFS or a new Hive table
pt: Guardar os resultados para HDFS ou para uma nova tabela Hive

source: Download the results in CSV format
pt: Transferir os resultados em formato CVS

source: Download the results in XLS format
pt: Transferir os resultados em formato XLS

source: Recent queries
pt: Consultas recentes

source: Log
pt: Registo

source: Columns
pt: Colunas

source: Results
pt: Resultados

source: Chart
pt: Gráfico

source: Explanation
pt: Explicação

source: Time
pt: Hora

source: Result
pt: Resultado

source: There is currently no query to visualize.
pt: De momento, não existem consultas para visualizar.

source: There are currently no logs to visualize.
pt: De momento, não existem registos para visualizar.

source: There are currently no columns to visualize.
pt: De momento, não existem colunas para visualizar.

source: Filter for column name or type...
pt: Filtro para nome ou tipo de coluna...

source: Fetching results ran into the following error(s):
pt: Ocorreram o(s) seguinte(s) erro(s) ao obter os resultados:

source: Show more results...
pt: Mostrar mais resultados...

source: The operation has no results.
pt: A operação não tem resultados.

source: The results have expired, rerun the query if needed.
pt: Os resultados expiraram; execute novamente a consulta conforme necessário.

source: There is currently no data to build a chart on.
pt: De momento, não existem dados para construir um gráfico.

source: Warning:
pt: Aviso:

source: the results on the chart have been limited to 1000 rows.
pt: os resultados no gráfico foram limitados a 1000 linhas.

source: Chart type
pt: Tipo de gráfico

source: Bars
pt: Barras

source: Lines
pt: Linhas
