Repository: lockhart39/HueQualityAndIngestionApp
Catalog: apps/beeswax/src/beeswax/locale/*/LC_MESSAGES/django.po
Languages: pt

source: Pie
pt: Circular

source: Map
pt: Mapa

source: X-Axis
pt: Eixo x

source: Y-Axis
pt: Eixo Y

source: No sorting
pt: Sem classificação

source: Sort ascending
pt: Classificação ascendente

source: Sort descending
pt: Classificação descendente

source: Label
pt: Etiqueta

source: Please select a chart type.
pt: Seleccione um tipo de gráfico.

source: Please specify parameters for this query
pt: Especifique os parâmetros para esta consulta

source: Execute query
pt: Executar consulta

source: Explain query
pt: Explicar consulta

source: Select a directory
pt: Seleccionar um directório

source: Select a file or directory
pt: Seleccionar um ficheiro ou directório

source: Choose a name
pt: Escolha um nome

source: Save Query Results
pt: Guardar resultados da consulta

source: In an HDFS file
pt: Num ficheiro HDFS

source: Path to CSV file
pt: Caminho do ficheiro CSV

source: In a new table
pt: Numa nova tabela

source: Table name or <database name>.<table name>
pt: Nome da tabela ou <database name>.<table name>

source: Big Query in HDFS
pt: Grande consulta em HDFS

source: Use this option if you have a large result. It will rerun the entire query and save the results to the chosen HDFS directory.
pt: Utilize esta opção se obtiver uma grande resultado. Executa novamente toda a consulta e guarda os resultados no directório HDFS escolhido.

source: Show advanced fields
pt: Mostrar campos avançados

source: Hide advanced fields
pt: Ocultar campos avançados

source: Showing _START_ to _END_ of _TOTAL_ entries
pt: A mostrar _START_ a _END_ de _TOTAL_ entradas

source: Showing 0 to 0 of 0 entries
pt: A mostrar 0 a 0 de 0 entradas

source: (filtered from _MAX_ total entries)
pt: (filtradas de um total de _MAX_ entradas)

source: First
pt: Primeiro

source: Last
pt: Último

source: Previous
pt: Anterior

source: See results...
pt: Ver resultados...

source: Example: SELECT * FROM tablename, or press CTRL + space
pt: Exemplo: SELECT * FROM nome de tabela, ou prima CTRL + espaço

source: Press "tab", then "enter".
pt: Prima "tab" e, em seguida, "enter".

source: Empty description
pt: Descrição vazia

source: Please select the latitude and longitude columns.
pt: Seleccione as colunas latitude e longitude.

source: Please select the columns you would like to see in this chart.
pt: Seleccione as colunas que gostaria de ver no gráfico.

source: Please select a column
pt: Seleccione uma coluna

source: No query provided to save.
pt: Nenhuma consulta fornecida para guardar.

source: Server error occurred:
pt: Ocorreu um erro no servidor:

source: Unmanageable server error occurred:
pt: Ocorreu um erro não gerível no servidor:

source: Query saved.
pt: Consulta guardada.

source: Could not save design
pt: Não foi possível guardar o design

source: Could not save results
pt: Não foi possível guardar os resultados

source: Problem:
pt: Problema:

source: Query canceled!
pt: Consulta cancelada!

source: Did you know?
pt: Sabia?

source: Missing some tables? In order to update the list of tables/metadata seen by Impala, execute one of these queries:
pt: Algumas tabelas em falta? Para poder actualizar a lista de tabelas/metadados vistos pela Impala, execute uma destas consultas:

source: Create table from file
pt: Criar tabela a partir ficheiro

source: Step 1: Choose File
pt: Passo 1: Escolher o ficheiro

source: Step 2: Choose Delimiter
pt: Passo 2: Escolher o delimitador

source: Step 3: Define Columns
pt: Passo 3: Definir as colunas

source: Choose a Delimiter
pt: Escolher um delimitador

source: Beeswax has determined that this file is delimited by
pt: O Beeswax determinou que este ficheiro está delimitado com

source: Preview
pt: Pré-visualizar

source: Enter the column delimiter which must be a single character. Use syntax like "\001" or " " for special characters.
pt: Introduza o delimitador de coluna, que tem de ter apenas um caracter. Utilize uma sintaxe do tipo "\001" ou " " para caracteres especiais.

source: Table preview
pt: Pré-visualização da tabela

source: Type your delimiter here
pt: Digite aqui o seu delimitador

source: Name Your Table and Choose A File
pt: Dê um nome à tabela e escolha um ficheiro

source: Use a table comment to describe the table. For example, note the data's provenance and any caveats users need to know.
pt: Utilize um comentário de tabela para descrever a tabela. Por exemplo, anote a procedência dos dados e quaisquer advertências que os utilizadores precisem saber.

source: The selected file is going to be moved during the import.
pt: O ficheiro seleccionado será movido durante a importação.

source: Define your columns
pt: Defina as colunas

source: Use first row as column names
pt: Utilize a primeira linha como nomes de coluna

source: Bulk edit column names
pt: Nomes de coluna de edição em volume

source: Sample Row
pt: Linha de amostra

source: Create Table
pt: Criar tabela

source: Write or paste comma separated column names
pt: Escreva ou copie nomes de colunas separados por vírgulas

source: e.g. id, name, salary
pt: por ex. id, nome, salário

source: My Queries
pt: As minhas consultas

source: Saved Queries
pt: Consultas guardadas

source: History
pt: Histórico

source: App Configurations
pt: Configurações de aplicação

source: Search for %s
pt: Pesquisar por %s

source: Edit the selected %s
pt: Editar o(s) %s seleccionado(s)

source: Edit
pt: Editar

source: Copy the selected %s
pt: Copiar o %s seleccionado

source: Copy
pt: Copiar

source: View the usage history of the selected %s
pt: Visualizar o histórico de utilização do %s seleccionado

source: Usage history
pt: Histórico de utilização

source: Move to trash
pt: Mover para o lixo

source: Delete forever
pt: Eliminar permanentemente

source: Create new %s
pt: Criar novo %s

source: New %s
pt: Novo %s

source: Go to the trash
pt: Ir para o lixo

source: View trash
pt: Ver o lixo

source: Owner
pt: Proprietário

source: Last Modified
pt: Última modificação

source: Move the selected %s to the trash?
pt: Mover o(s) %s seleccionado(s) para o lixo?

source: Delete the selected %s?
pt: Eliminar o(s) %s seleccionado(s)?

source: Unsaved
pt: Não guardado

source: Copy this query.
pt: Copiar esta consulta.

source: Auto generated action
pt: Acção gerada automaticamente

source: Actions
pt: Acções

source: Show my queries
pt: Mostrar as minhas consultas

source: Show everyone's queries
pt: Mostrar as consultas de todos

source: Show auto queries
pt: Mostrar consultas automáticas

source: Show only saved queries
pt: Mostrar apenas as consultas guardadas

source: Search for name, query, etc.
pt: Pesquisar por nome, consulta, etc.

source: User
pt: Utilizador

source: State
pt: Estado

source: Trashed Queries
pt: Consultas enviadas para o lixo

source: Search for query
pt: Pesquisar por consulta

source: Restore from trash
pt: Restaurar do lixo

source: Restore
pt: Restaurar

source: Empty trash
pt: Esvaziar lixo

source: View queries
pt: Ver consultas

source: ago
pt: atrás

source: Restore the selected queries?
pt: Restaurar as consultas seleccionadas?

source: Delete the selected queries?
pt: Eliminar as consultas seleccionadas?

source: Empty the trash?
pt: Esvaziar o lixo?

source: View the result of the selected
pt: Visualizar o resultado do seleccionado

source: View result
pt: Visualizar resultado

source: Edit the selected query
pt: Editar a consulta seleccionada

source: Copy the selected query
pt: Copiar a consulta seleccionada

source: View the usage history of the selected query
pt: Visualizar o histórico de utilização da consulta seleccionada

source: Create new query
pt: Criar uma nova consulta

source: Recent Saved Queries
pt: Consultas guardadas recentemente

source: Recent Run Queries
pt: Consultas executadas recentemente

source: View all my queries
pt: Visualizar todas as minhas consultas

source: View my entire query history
pt: Visualizar o meu histórico de consultas completo

source: Move the selected queries to the trash?
pt: Mover as consultas seleccionadas para o lixo?

source: In an HDFS directory
pt: Num directório HDFS

source: Results location
pt: Localização dos resultados

source: Unsaved Query
pt: Consulta não guardada

source: Query Results
pt: Resultados da consulta

source: Collapse this panel
pt: Recolher este painel

source: Download as CSV
pt: Download em CSV

source: Download as XLS
pt: Download em XLS

source: MapReduce Job
pt: Trabalho MapReduce

source: MapReduce Jobs
pt: Trabalhos MapReduce

source: No Hadoop jobs were launched in running this query.
pt: Nenhuma tarefa Hadoop foi iniciada ao executar esta consulta.

source: Multi-statement query
pt: Consulta de várias instruções

source: Hue stopped as one of your query contains some results.
pt: O Hue parou porque uma das suas consultas obteve alguns resultados.

source: Click on
pt: Clique em

source: next
pt: seguinte

source: to continue execution of the remaining statements.
pt: para continuar a execução das declarações restantes.

source: If the result contains a large number of columns, click a row to select a column to jump to
pt: Se o resultado tiver um elevado número de colunas, clique numa fila para seleccionar uma coluna para a qual avançar

source: Save huge results on HDFS and download them with FileBrowser
pt: Guardar resultados grandes no HDFS e transferi-los com o FileBrowser

source: Query Results:
pt: Resultados da consulta:

source: Error
pt: Erro

source: The query result has expired.
pt: O resultado da consulta expirou.

source: You can rerun it from
pt: Pode voltar a executar a partir de

source: Page offset may have incremented since last view.
pt: O offset da página pode ter sido incrementado desde a última visualização.

source: You have reached the last record for this query.
pt: Alcançou o último registo para esta consulta.

source: In text with columns separated by ^A and rows separated by newlines. JSON for non-primitive type columns.
pt: Em texto com colunas separado por ^A e filas separadas por novas linhas. JSON para colunas de tipo não primitivo.

source: Name or directory required.
pt: Nome ou directório necessários.

source: Download results from the left.
pt: Transferir resultados da esquerda.
