Repository: lockhart39/HueQualityAndIngestionApp
Catalog: desktop/libs/libsaml/src/libsaml/locale/*/LC_MESSAGES/django.po
Languages: pt

source: Xmlsec1 binary path. This program should be executable by the user running Hue.
pt: Caminho binário Xmlsec1. Este programa deve ser executável pelo utilizador que estiver a executar o Hue.

source: Entity ID for Hue acting as service provider. Can also accept a pattern where '<base_url>' will be replaced with server URL base.
pt: ID de entidade para o Hue que actua como fornecedor de serviços. Pode também aceitar um padrão em que "<base_url>" será substituído com a base URL de servidor.

source: Create users from IdP on login.
pt: Criar utilizadores de IdP no início de sessão.

source: Attribute map directory contains files that map SAML attributes to pysaml2 attributes.
pt: O directório de mapa de atributo contém ficheiros que mapeiam atributos SAML para atributos pysaml2.

source: Allow responses that are initiated by the IdP.
pt: Permitir respostas que são iniciadas pelo IdP.

source: Required attributes to ask for from IdP.
pt: Atributos necessários para perguntar a partir do IdP.

source: Optional attributes to ask for from IdP.
pt: Atributos opcionais para perguntar a partir do IdP.

source: IdP metadata in the form of a file. This is generally an XML file containing metadata that the Identity Provider generates.
pt: Metadados IdP na forma de um ficheiro. Este é normalmente um ficheiro XML que contém metadados que o Fornecedor de Identidade gera.

source: key_file is the name of a PEM formatted file that contains the private key of the Hue service. This is presently used both to encrypt/sign assertions and as client key in a HTTPS session.
pt: key_file é o nome de um ficheiro PEM formatado que contém a chave privada do serviço Hue. Este é actualmente utilizado para encriptar/assinar asserções e como chave de cliente numa sessão HTTPS.

source: This is the public part of the service private/public key pair. cert_file must be a PEM formatted certificate chain file.
pt: Esta é a parte pública do par de chave privada/pública do serviço. cert_file tem de ser um ficheiro de cadeia de certificados formatado para PEM.

source: A mapping from attributes in the response from the IdP to django user attributes.
pt: Um mapeamento de atributos na resposta do IdP para atributos de utilizador django.

source: Have Hue initiated authn requests be signed and provide a certificate.
pt: Os pedidos de authn iniciados pelo Hue devem ser assinados e dever ser fornecido um certificado.

source: Have Hue initiated logout requests be signed and provide a certificate.
pt: Se o Hue tiver iniciado o final de sessão, devem ser assinados pedidos e ser fornecido um certificado.

source: Username can be sourced from 'attributes' or 'nameid'
pt: O nome de utilizador pode ter origem em "attributes" ou "nameid"

source: Performs the logout or not.
pt: Executa o final de sessão ou não.

source: Request this NameID format from the server
pt: Solicitar este formato de NameID ao servidor

source: username_source not configured properly. SAML integration may not work.
pt: username_source não configurado correctamente. Integração SAML pode não funcionar.
