Repository: lockhart39/HueQualityAndIngestionApp
Catalog: apps/oozie/src/oozie/locale/*/LC_MESSAGES/django.po
Languages: pt

source: When to start the first coordinators.
pt: Quando iniciar os primeiros coordinators.

source: Variables
pt: Variáveis

source: Workspace
pt: Área de trabalho

source: Hadoop Properties
pt: Propriedades do Hadoop

source: Show graph arrows
pt: Mostrar setas do gráfico

source: Version
pt: Versão

source: SLA Configuration
pt: Configuração SLA

source: Action failed, error message[${wf:errorMessage(wf:lastErrorNode())}]
pt: A acção falhou, mensagem de erro [${wf:errorMessage(wf:lastErrorNode())}]

source: Path to the script on HDFS.
pt: Caminho para o script no HDFS.

source: The Pig parameters of the script without -param. e.g. INPUT=${inputDir}
pt: Os parâmetros do Pig do script sem "-param", por exemplo "INPUT=${inputDir}"

source: The Pig parameters of the script as is. e.g. -param, INPUT=${inputDir}
pt: Os parâmetros do Pig do script como tal, por exemplo, "-param", "INPUT=${inputDir}"

source: Files put in the running directory.
pt: Ficheiros colocados no directório em execução.

source: zip, tar and tgz/tar.gz uncompressed into the running directory.
pt: zip, tar e tgz/tar.gz descomprimidos no directório em execução.

source: value, e.g. production
pt: valor, por exemplo produção

source: Path to manipulate before starting the application.
pt: Caminho para manipular antes de iniciar a aplicação.

source: Refer to a Hadoop JobConf job.xml
pt: Consulte um Hadoop JobConf job.xml

source: Path to the jar on HDFS.
pt: Caminho para o jar no HDFS.

source: Java class. e.g. org.apache.hadoop.examples.Grep
pt: Classe Java, por exemplo org.apache.hadoop.examples.Grep

source: Parameters for the JVM, e.g. -Dprop1=a -Dprop2=b
pt: Parâmetros para o JVM, por exemplo -Dprop1=a -Dprop2=b

source: Refer to a hive-site.xml for connecting to Hive
pt: Consulte um hive-site.xml para estabelecer a ligação com o Hive

source: Password
pt: Palavra-passe

source: The password element must contain the password of the current user. However, the password is only used if Hive Server 2 is backed by something requiring a password (e.g. LDAP); non-secured Hive Server 2 or Kerberized Hive Server 2 don't require a password.
pt: O elemento de palavra-passe tem de incluir a palavra-passe do utilizador actual. No entanto, a palavra-passe apenas é utilizada se o Hive Server 2 for apoiado por algo que exija uma palavra-passe (por exemplo LDAP). O Hive Server 2 não protegido e o Kerberized Hive Server 2 não requerem uma palavra-passe.

source: The sub-workflow application to include. You must own all the sub-workflows
pt: A aplicação de subworkflow a incluir. Tem de ser proprietário de todos os subworkflows.

source: Sqoop command
pt: Comando Sqoop

source: Shell command
pt: Comando Shell

source: Shell command to execute, e.g script.sh
pt: Comando Shell para executar, por exemplo, script.sh

source: One arg, e.g. -l, --help
pt: Um arg, por exemplo -l, --help

source: Environment variables
pt: Variáveis do ambiente

source: e.g. MAX=10 or PATH=$PATH:mypath
pt: por exemplo MAX=10 ou PATH=$PATH:mypath

source: User and Host
pt: Utilizador e anfitrião

source: Ssh command
pt: Comando Ssh

source: Deletes recursively all content.
pt: Elimina recursivamente todo o conteúdo.

source: Sub directories are created if needed.
pt: São criados subdirectórios, se necessário.

source: Move file or directory
pt: Mover um ficheiro ou directório

source: Destination.
pt: Destino.

source: File or directory.
pt: Ficheiro ou directório.

source: Or update its modification date.
pt: Ou actualize a respectiva data de modificação.

source: Change the group
pt: Altere o grupo

source: To addresses
pt: Endereços Para

source: Comma-separated values
pt: Valores separados por vírgulas

source: Plain-text
pt: Texto simples.

source: Options first, then source / destination paths
pt: Opções primeiro, depois os caminhos de fonte/destino

source: Message
pt: Mensagem

source: Message to display when the workflow fails. Can contain some EL functions.
pt: Mensagem a apresentar quando o workflow falha. Pode conter algumas funções EL.

source: Java program
pt: Programa Java

source: Could not set field %(field)s: %(exception)s
pt: Não foi possível definir o campo %(field)s: %(exception)s

source: invalid frequency: %s
pt: frequência inválida: %s

source: Tag with namespace %(namespace)s is not valid. Please use one of the following namespaces: %(namespaces)s
pt: A etiqueta com o namespace %(namespace)s não é válida. Utilize um dos seguintes namespaces: %(namespaces)s

source: Could not find any nodes in Bundle definition. Maybe it's malformed?
pt: Não foi possível localizar nenhum nó na definição do bundle. Talvez esteja incorrecto?

source: Could not find any nodes in Coordinator definition. Maybe it's malformed?
pt: Não foi possível localizar nenhum nó na definição do Coordinator. Talvez esteja incorrecto?

source: Node with name %s for workflow %s does not exist.
pt: O nó com o nome %s para o workflow %s não existe.

source: Node %s has a link that is missing 'to' attribute.
pt: O nó %s contém uma ligação com o atributo "para" em falta.

source: Node %s has not been defined.
pt: O nó %s não foi definido.

source: Node %s has a link that is missing 'start' attribute.
pt: O nó %s contém uma ligação com o atributo "início" em falta.

source: Node %s has not been defined
pt: O nó %s não foi definido

source: Workflow start has not been created.
pt: O início do workflow não foi criado.

source: Workflow end has not been created.
pt: O fim do workflow não foi criado.

source: Cannot import workflows that have decision DAG leaf nodes with multiple children or no children.
pt: Não é possível importar workflows que tenham nós de decisão DAG com vários ou nenhum subordinado.

source: Cannot import workflows that have decisions paths with multiple terminal nodes that converge on a single terminal node.
pt: Não é possível importar workflows que tenham caminhos de decisão com vários nós terminais que convergem num único nó terminal.

source: Cannot import workflows that have decisions paths that never end.
pt: Não é possível importar workflows que contêm caminhos de decisões intermináveis.

source: Different ends found in fork.
pt: Foram encontrados finais diferentes no fork.

source: No hadoop file system to operate on.
pt: Nenhum sistema de ficheiros hadoop sobre o qual operar.

source: Could not find workflow name when resolving subworkflow.
pt: Não foi possível encontrar o nome do workflow ao resolver o subworkflow.

source: Could not find workflow with name %s extracted from subworkflow path %s
pt: Não foi possível encontrar um workflow com o nome %s extraído do caminho do subworkflow %s

source: Could not find workflow at path %s: %s
pt: Não foi possível localizar o workflow no caminho %s: %s

source: Could not find any nodes in Workflow definition. Maybe it's malformed?
pt: Não foi possível localizar nenhum nó na definição do workflow. Talvez esteja incorrecto?

source: Installing workflow %s
pt: A instalar workflow %s

source: Installing coordinator %s
pt: A instalar coordinator %s

source: Installing bundle %s
pt: A instalar bundle %s

source: Creating sample directory '%s' in HDFS
pt: A criar directório de amostra "%s" no HDFS

source: Copying examples %(local_dir)s to %(remote_data_dir)s
pt: Copiar exemplos de %(local_dir)s para %(remote_data_dir)s

source: Copying data %(local_dir)s to %(remote_data_dir)s
pt: A copiar dados de %(local_dir)s para %(remote_data_dir)s

source: Installing examples...
pt: A instalar exemplos...

source: Cannot backwards migrate this change.
pt: Não é possível migrar esta alteração para trás.

source: Oozie Dashboard
pt: Painel Oozie

source: Oozie Editor
pt: Editor Oozie

source: This is the old editor, please migrate your jobs to the
pt: Este é o editor antigo, transfira os jobs para o

source: new editor.
pt: novo editor.

source: Value
pt: Valor

source: Enable
pt: Activar

source: Nominal time
pt: Tempo nominal

source: Should start
pt: Deve iniciar

source: Should end
pt: Deve terminar

source: Max duration
pt: Duração máxima

source: Alert events
pt: Eventos de alerta

source: Alert contact
pt: Contacto de alerta

source: Notification message
pt: Mensagem de notificação

source: My Job has encountered an SLA event!
pt: O meu trabalho encontrou um evento SLA!

source: Upstream apps
pt: Aplicações a montante

source: Choose a
pt: Seleccione

source: folder
pt: pasta

source: file
pt: ficheiro

source: The end cannot be before the starting moment
pt: O fim não pode ocorrer antes do momento inicial

source: -all-
pt: -tudo-

source: minute
pt: minuto

source: hour
pt: hora

source: day
pt: dia

source: week
pt: semana

source: month
pt: mês

source: year
pt: ano

source: Every
pt: Cada

source: at
pt: em

source: minutes past the hour
pt: minutos decorridos desde a hora

source: on
pt: a

source: of
pt: de

source: on the
pt: no

source: The tag %s is not supported !
pt: A etiqueta %s não é suportada!

source: Bad number of elements
pt: Mau número de elementos

source: The jquery_element should be set into jqCron settings
pt: O elemento jquery_element deve ser configurado nas definições jqCron

source: Unrecognized expression
pt: Expressão não reconhecida

source: sunday
pt: domingo

source: monday
pt: segunda-feira

source: tuesday
pt: terça-feira

source: wednesday
pt: quarta-feira

source: thursday
pt: quinta-feira

source: friday
pt: sexta-feira

source: saturday
pt: sábado

source: january
pt: Janeiro

source: february
pt: Fevereiro

source: march
pt: Março

source: april
pt: Abril

source: may
pt: Maio

source: june
pt: Junho

source: july
pt: Julho

source: august
pt: Agosto

source: september
pt: Setembro

source: october
pt: Outubro

source: november
pt: Novembro

source: december
pt: Dezembro

source: Do you really want to kill the selected jobs?
pt: Pretende realmente eliminar os jobs seleccionados?

source: No
pt: Não

source: Yes
pt: Sim

source: The selected jobs have been suspended correctly.
pt: Os jobs seleccionados foram correctamente suspendidos.

source: Some of the selected jobs may not have been suspended correctly:
pt: Alguns dos jobs seleccionados podem não ter sido correctamente suspendidos:

source: The selected jobs have been resumed correctly.
pt: Os jobs seleccionados foram correctamente retomados.

source: Some of the selected jobs may not have been resumed correctly:
pt: Alguns dos jobs seleccionados podem não ter sido correctamente retomados:

source: The selected jobs have been killed correctly.
pt: Os jobs seleccionados foram correctamente eliminados.

source: Some of the selected jobs may not have been killed correctly:
pt: Alguns dos jobs seleccionados podem não ter sido correctamente eliminados:

source: Bundle Dashboard
pt: Painel de bundle

source: Submitter
pt: Responsável pelo envio

source: Status
pt: Estado

source: Progress
pt: Progresso

source: Kick off time
pt: Hora de início

source: Manage
pt: Gerir

source: Kill %(bundle)s
pt: Eliminar %(bundle)s

source: Are you sure you want to kill bundle %s?
pt: Tem a certeza de que pretende eliminar o pacote %s?

source: The bundle was killed!
pt: O pacote foi eliminado!

source: Are you sure you'd like to kill this job?
pt: Quer mesmo matar este trabalho?

source: Kill
pt: Eliminar

source: Rerun
pt: Executar novamente

source: Suspend the bundle after finishing the current running actions
pt: Suspender o bundle depois de terminar as acções actualmente em execução

source: Are you sure you'd like to suspend this job?
pt: Tem certeza de que pretende interromper este trabalho?

source: Suspend
pt: Suspender

source: Resume the bundle
pt: Retomar o bundle

source: Are you sure you'd like to resume this job?
pt: Tem certeza de que pretende retomar este trabalho?

source: Resume
pt: Retomar

source: Actions
pt: Acções

source: Details
pt: Detalhes

source: Configuration
pt: Configuração

source: Log
pt: Registo

source: Definition
pt: Definição

source: Last action
pt: Última acção

source: Next materialization
pt: Próxima materialização

source: There are no actions to be shown.
pt: Não existem acções para apresentar.

source: Frequency
pt: Frequência

source: Time Unit
pt: Unidade de tempo

source: Time out
pt: Tempo limite

source: Start Time
pt: Hora de início

source: End Time
pt: Hora de fim

source: Pause Time
pt: Hora de pausa

source: Created time
pt: Hora de criação

source: Back
pt: Voltar

source: Problem:
pt: Problema:

source: Error:
pt: Erro:

source: Bundles Dashboard
pt: Painel de bundles

source: Search for username, name, etc...
pt: Pesquisar por nome de utilizador, nome, etc...

source: Resume selected
pt: Retomar os elementos seleccionados

source: Suspend selected
pt: Suspender os elementos seleccionados

source: Kill selected
pt: Eliminar os elementos seleccionados

source: Show only
pt: Mostrar apenas

source: days with status
pt: dias com o estado

source: Succeeded
pt: Bem-sucedido

source: Running
pt: Em execução

source: Kickoff Time
pt: Hora de início

source: Created Time
pt: Hora de criação

source: Previous
pt: Anterior

source: Next
pt: Seguinte

source: Completed
pt: Concluído

source: No matching records
pt: Não existem registos correspondentes

source: Coordinator Dashboard
pt: Painel de coordinator

source: Next Materialized Time
pt: Próxima hora materializada

source: Datasets
pt: Conjuntos de dados

source: No available datasets
pt: Nenhum dataset disponível

source: Resume the coordinator
pt: Retomar o coordinator

source: Suspend the coordinator after finishing the current running actions
pt: Suspender o coordinator depois de terminar as acções actualmente em execução

source: Kill %(coordinator)s
pt: Eliminar %(coordinator)s

source: Are you sure you want to kill coordinator %s?
pt: Tem a certeza de que pretende eliminar o coordinator %s?

source: The coordinator was killed!
pt: O coordinator foi eliminado!

source: Edit
pt: Editar

source: Calendar
pt: Calendário

source: Filter results
pt: Filtrar resultados

source: Day
pt: Dia

source: Workflow not available or instantiated yet
pt: Workflow ainda indisponível ou não instanciado

source: Number
pt: Número

source: Nominal Time
pt: Tempo nominal

source: Error Code
pt: Código de erro

source: Error Message
pt: Mensagem de erro

source: Missing Dependencies
pt: Dependências em falta

source: Last Modified
pt: Última modificação

source: External Id
pt: ID externa

source: Start time
pt: Hora de início

source: End time
pt: Hora de fim

source: Last
pt: Último

source: Warning
pt: Aviso

source: Time since Nominal Time in min
pt: Tempo desde o Tempo nominal em minutos

source: Expected Start
pt: Início esperado

source: Actual Start
pt: Início real

source: Expected End
pt: Fim esperado

source: Actual End
pt: Fim real

source: Expected Duration
pt: Duração esperada

source: Actual Duration
pt: Duração real

source: Cancel
pt: Cancelar

source: click for the SLA dashboard
pt: clique para o painel SLA

source: No data available
pt: Não existem dados disponíveis

source: Coordinators Dashboard
pt: Painel de coordinators

source: Next Submission
pt: Próximo envio

source: Completion
pt: Conclusão

source: Duration
pt: Duração

source: Oozie Information
pt: Informação Oozie

source: Oozie status
pt: Estado Oozie

source: Instrumentation
pt: Instrumentação

source: Metrics
pt: Métricas

source: Text Filter
pt: Filtro de texto

source: No metrics available for this section.
pt: Nenhuma métrica disponível para esta secção.

source: Search
pt: Pesquisar

source: Name or Id
pt: Nome ou ID

source: Job Name or Id (required)
pt: Nome ou ID de trabalho (necessário)

source: Date in GMT
pt: Data em GMT

source: Date filter
pt: Filtro de dados

source: Use the form above to search for SLAs.
pt: Utilize o formulário acima para pesquisar SLA.

source: The server returned no results.
pt: O servidor não devolveu resultados.

source: List
pt: Lista

source: Chart
pt: Gráfico

source: Job Status
pt: Estado da tarefa

source: click for more details
pt: clique para obter mais detalhes

source: Workflow Dashboard
pt: Painel de workflow

source: Edit workflow
pt: Editar workflow

source: Kill %(workflow)s
pt: Eliminar %(workflow)s

source: Are you sure you want to kill workflow %s?
pt: Tem certeza de que deseja eliminar o workflow %s?

source: The workflow was killed.
pt: O workflow foi eliminado.

source: Suspend the workflow after finishing the current running actions
pt: Suspender o workflow depois de terminar as acções actualmente em execução

source: Resume the workflow
pt: Retomar o workflow

source: Rerun the same workflow
pt: Executar novamente o mesmo workflow

source: Graph
pt: Gráfico

source: Logs
pt: Registos

source: Transition
pt: Transição

source: Data
pt: Dados

source: Group
pt: Grupo

source: Application Path
pt: Caminho da aplicação

source: Run
pt: Executar

source: Workflow Action
pt: Acção de workflow

source: View the logs
pt: Visualizar os registos

source: Action
pt: Acções

source: Child Jobs
pt: Trabalhos subordinados

source: Property
pt: Propriedade

source: External Status
pt: Estado externo

source: No child jobs
pt: Não existem trabalhos subordinados

source: Workflows Dashboard
pt: Painel de workflows

source: Submission
pt: Envio

source: Select coordinators to rerun
pt: Seleccione os coordinators a executar novamente

source: Submit
pt: Enviar

source: Select all
pt: Seleccionar tudo

source: No successful actions found.
pt: Não foram encontradas acções bem-sucedidas.

source: Select actions to rerun
pt: Seleccionar acções para voltar a executar

source: All or skip successful
pt: Todos ou ignorar bem sucedido

source: Only failed
pt: Apenas falhados

source: Done
pt: Concluído

source: Action type
pt: Tipo de acção

source: Advanced
pt: Avançada

source: Credentials
pt: Credenciais

source: Requires hbase-site.xml in job-xml field
pt: Necessita de hbase-site.xml em campo job-xml

source: Error link to
pt: Hiperligação de erro para

source: All the paths are relative to the deployment directory. They can be absolute but this is not recommended.
pt: Todos os caminhos são relativos ao directório de implementação. Podem ser absolutos, mas não é recomendado.

source: All the paths need to be absolute.
pt: Todos os caminhos têm de ser absolutos.

source: You can parameterize values using case sensitive
pt: Pode parametrizar valores sensíveis a maiúsculas e minúsculas

source: The SSH server requires passwordless login
pt: O servidor SSH requer início de sessão sem palavra-passe.

source: The delegation token needs to be propagated from the launcher job to the MR job
pt: O token da delegação tem de ser propagado a partir do trabalho inicial para o trabalho MR

source: Requires some SMTP server configuration to be present (in oozie-site.xml)
pt: Necessita que algumas configurações do servidor SMTP estejam presentes (em oozie-site.xml)

source: Add delete
pt: Adicionar delete

source: Add mkdir
pt: Adicionar mkdir

source: Add param
pt: Adicionar parâmetro

source: Add argument
pt: Adicionar argumento

source: Add env-var
pt: Adicionar variável de ambiente

source: Add arg
pt: Adicionar argumento

source: Delete
pt: Eliminar

source: Add path
pt: Adicionar caminho

source: Add archive
pt: Adicionar ficheiro

source: Job properties
pt: Propriedades do trabalho

source: Property name
pt: Nome da propriedade

source: Add property
pt: Adicionar propriedade

source: Source
pt: Origem

source: Destination
pt: Destino

source: Add move
pt: Adicionar move

source: Path
pt: Caminho

source: Permissions
pt: Permissões

source: Recursive
pt: Recursivo

source: Add chmod
pt: Adicionar chmod

source: Params
pt: Parâmetros

source: label
pt: etiqueta

source: Prepare
pt: Preparar

source: Convert this fork into a decision?
pt: Converter este fork numa decisão?

source: Examples of predicates:
pt: Exemplos de predicados:

source: More on predicates
pt: Mais sobre predicados

source: Predicate
pt: Predicado

source: go to
pt: ir para

source: default
pt: predefinição

source: Add
pt: Adicionar

source: When
pt: Quando

source: Check syntax ?
pt: Verificar sintaxe?

source: advanced
pt: avançadas

source: The time frequency at which interval a workflow should be submitted by the coordinator. For example, once a day, every Monday at midnight, every week days, every three days...
pt: A frequência de tempo segundo a qual um workflow deve ser enviado pelo coordinator. Por exemplo, uma vez por dia, todas as segundas-feiras à meia-noite, todos os dias da semana, a cada três dias...

source: Create Bundle
pt: Criar bundle

source: Properties
pt: Propriedades

source: Edit properties
pt: Editar propriedades

source: Bundle data
pt: Dados do bundle

source: Save
pt: Guardar

source: Add coordinator to the Bundle
pt: Adicionar coordinator ao Bundle

source: Create Coordinator
pt: Criar coordinator

source: Coordinator Editor
pt: Editor de coordinator

source: Step 1: Details
pt: Passo 1: detalhes

source: Step 2: Frequency
pt: Passo 2: frequência

source: Step 3: Inputs
pt: Passo 3: entradas

source: Step 4: Outputs
pt: Passo 4: saídas

source: Step 5: Advanced settings
pt: Passo 5: definições avançadas

source: Schedule
pt: Programar

source: UTC time only. (e.g. if you want 10pm PST (UTC+8) set it 8 hours later to 6am the next day.
pt: Hora UTC apenas (por exemplo, se quiser 22:00 PST (UTC+8), defina-a 8 horas depois para 06:00 do dia seguinte.

source: This field is required.
pt: Este campo é obrigatório.

source: You can parameterize the values using
pt: Pode parametrizar os valores, utilizando

source: Create Workflow
pt: Criar workflow

source: New workflow
pt: Novo workflow

source: Instance
pt: Instância

source: Default
pt: Predefinição

source: Single
pt: Único

source: Range
pt: Intervalo

source: (advanced)
pt: (avançadas)

source: Edit Bundle
pt: Editar Bundle

source: Show selected
pt: Mostrar elemento seleccionado

source: History
pt: Histórico

source: Show history
pt: Mostrar histórico

source: Submit this bundle
pt: Enviar este bundle

source: Copy this bundle
pt: Copiar este bundle

source: Copy
pt: Copiar

source: Bundle Editor :
pt: Editor de bundle:

source: Step 1: General
pt: Passo 1: geral

source: Step 2: Advanced settings
pt: Passo 2: definições avançadas

source: Advanced settings
pt: Definições avançadas

source: Save bundle
pt: Guardar bundle

source: Click to view the coordinator
pt: Clique para visualizar o coordinator

source: There are currently no coordinator in this bundle.
pt: De momento, não existe um coordinator neste pacote.

source: Do you want to add a coordinator ?
pt: Tem certeza de que pretende adicionar o coordinator?

source: Date
pt: Data

source: Edit bundled coordinator
pt: Editar coordinator do pacote

source: Edit Coordinator
pt: Editar Coordinator

source: Create new
pt: Criar novo

source: Show existing
pt: Mostrar existente

source: Submit this coordinator
pt: Enviar este coordinator

source: Copy this coordinator
pt: Copiar este coordinator

source: Coordinator Editor :
pt: Editor de Coordinator:

source: Inputs
pt: Entradas

source: The inputs and outputs of the workflow must be mapped to some data.
pt: As entradas e saídas do workflow devem estar mapeadas para alguns dados.

source: The data is represented by some datasets that can be created
pt: Os dados são representados por alguns datasets que podem ser criados

source: here
pt: aqui

source: This type of coordinator does not require any dataset.
pt: Este tipo de coordinator não requer quaisquer conjuntos de dados.

source: There are currently no defined inputs.
pt: Neste momento, não há entradas definidas.

source: Outputs
pt: Saídas

source: There are currently no defined outputs.
pt: Neste momento, não há saídas definidas.

source: Save coordinator
pt: Guardar coordinator

source: Create a new dataset
pt: Criar um novo dataset
