Repository: lockhart39/HueQualityAndIngestionApp
Catalog: apps/oozie/src/oozie/locale/*/LC_MESSAGES/django.po
Languages: pt

source: Location on local FS where the xslt files are stored for workflow import.
pt: Localização no SF local onde os ficheiros xslt estão guardados para a importação de workflow.

source: Location on local filesystem where the examples are stored.
pt: Localização no sistema de ficheiros local onde os exemplos estão guardados.

source: Location on local filesystem where the data for the examples is stored.
pt: Localização no sistema de ficheiros local onde os dados para os exemplos estão guardados.

source: Location on HDFS where the Oozie workflows are stored. Parameters are $TIME and $USER, e.g. /user/$USER/hue/workspaces/workflow-$TIME
pt: Localização no HDFS onde os workflows do Oozie estão armazenados. Os parâmetros são $TIME e $USER, por exemplo /user/$USER/hue/workspaces/workflow-$TIME

source: Maximum number of Oozie workflows or coodinators or bundles to retrieve in one API call.
pt: Número máximo de workflows ou coordinators ou bundles Oozie para obter numa chamada de API.

source: Use version 2 of Editor.
pt: Utilize a versão 2 do Editor.

source: Use Cron format for defining the frequency of a Coordinator instead of the old frequency number/unit.
pt: Utilizar formato Cron para definir a frequência de um Coordinator, em vez do número/da unidade de frequência anterior.

source: The app won't work without a running Oozie server
pt: A aplicação não funciona sem um servidor Oozie em execução

source: Job %(id)s does not exist
pt: O job %(id)s não existe

source: Local workflow.xml file
pt: Ficheiro workflow.xml local

source: Workflow resource archive (zip)
pt: Ficheiro de recursos de workflow (zip)

source: Local coordinator.xml file
pt: Ficheiro .xml de coordinator de região

source: Coordinator resource archive (zip)
pt: Arquivo de recurso do Coordinator (zip)

source: Used to indicate if user wants to refresh an action's input and output events
pt: Utilizado para indicar se o utilizador pretende actualizar os eventos de entrada e saída de uma acção

source: Used to indicate if user wants to cleanup output events for given rerun actions
pt: Utilizado para indicar se o utilizador pretende limpar os eventos de saída para determinadas acções executadas novamente

source: Enter a valid value: combination of 2 - 40 letters and digits starting by a letter
pt: Introduza um valor válido: uma combinação de 2 - 40 letras e dígitos, iniciados por uma letra

source: Permission denied. %(username)s does not have the permissions required to access job %(id)s
pt: Permissão negada. %(username)s não possui as permissões necessárias para aceder ao trabalho %(id)s

source: job %(id)s does not exist
pt: o job %(id)s não existe

source: Not allowed to modified this job
pt: Não é permitido modificar este trabalho

source: Owner
pt: Proprietário

source: Person who can modify the job.
pt: Pessoa que pode modificar o trabalho.

source: Name of the job, which must be unique per user.
pt: Nome do trabalho, que tem de ser único por utilizador.

source: Name
pt: Nome

source: Description
pt: Descrição

source: The purpose of the job.
pt: A finalidade do trabalho.

source: Last modified
pt: Última modificação

source: Schema version
pt: Versão do esquema

source: The version of the XML schema used to talk to Oozie.
pt: A versão do esquema XML utilizado para comunicar com o Oozie.

source: HDFS deployment directory
pt: Directório de implementação no HDFS

source: The path on the HDFS where all the workflows and dependencies must be uploaded.
pt: Caminho no HDFS onde todos os workflows e dependências devem ser carregados.

source: Is shared
pt: É partilhado

source: Enable other users to have access to this job.
pt: Permitir que outros utilizadores tenham acesso a este trabalho.

source: Oozie parameters
pt: Parâmetros Oozie

source: Parameters used at the submission time (e.g. market=US, oozie.use.system.libpath=true).
pt: Parâmetros utilizados no momento de submissão (por exemplo, market=US, oozie.use.system.libpath=true).

source: Is trashed
pt: Está no lixo

source: If this job is trashed.
pt: Se este trabalho for enviado para o lixo.

source: shared
pt: partilhado

source: personal
pt: pessoal

source: Refer to a Hadoop JobConf job.xml file bundled in the workflow deployment directory. Properties specified in the Job Properties element override properties specified in the files specified in the Job XML element.
pt: Consulte um ficheiro JobConf job.xml do Hadoop incluído no directório de implementação dos workflows. As propriedades especificadas no elemento Job Properties (Propriedades do Trabalho) substituem as propriedades especificadas nos ficheiros especificados no elemento XML do trabalho.

source: Hadoop job properties
pt: Propriedades do trabalho Hadoop

source: Job configuration properties used by all the actions of the workflow (e.g. mapred.job.queue.name=production)
pt: Propriedades de configuração do trabalho, utilizadas por todas as acções do workflow (por exemplo, mapred.job.queue.name=production)

source: The copy of the deployment directory failed: %s.
pt: Falha ao copiar directório de implementação: %s.

source: Name of the action, which must be unique by workflow.
pt: Nome da acção, que tem de ser única no workflow.

source: The purpose of the action.
pt: A finalidade da acção.

source: Type
pt: Tipo

source: The type of action (e.g. MapReduce, Pig...)
pt: Tipo de acção (por exemplo, MapReduce, Pig...)

source: Unknown Node type: %s. Was it set at its creation?
pt: Tipo de nó desconhecido: %s. Foi definido aquando da criação?

source: %(node_type)s has not implemented the 'add_node' method.
pt: %(node_type)s não implementou o método "adicionar nó".

source: Files
pt: Ficheiros

source: List of names or paths of files to be added to the distributed cache and the task running directory.
pt: Lista de nomes ou caminhos de ficheiros a adicionar à cache distribuída e ao directório de execução da tarefa.

source: Archives
pt: Ficheiros

source: List of names or paths of the archives to be added to the distributed cache.
pt: Lista de nomes ou caminhos dos ficheiros a adicionar à cache distribuída.

source: For the job configuration (e.g. mapred.job.queue.name=production)
pt: Para a configuração do trabalho (por exemplo, mapred.job.queue.name=production)

source: Jar name
pt: Nome jar

source: Name or path to the %(program)s jar file on HDFS. E.g. examples.jar.
pt: Nome ou caminho para o ficheiro jar %(program)s no HDFS. Por exemplo, examples.jar.

source: Prepares
pt: Prepara

source: List of absolute paths to delete and then to create before starting the application. This should be used exclusively for directory cleanup.
pt: Lista de caminhos absolutos a eliminar e a criar antes de iniciar a aplicação. Deve ser utilizada exclusivamente para a limpeza de directórios.

source: The executable/script to be used as mapper.
pt: O executável/script a utilizar como mapper.

source: The executable/script to be used as reducer.
pt: O executável/script a utilizar como reducer.

source: Main class
pt: Classe Main

source: Full name of the Java class. E.g. org.apache.hadoop.examples.Grep
pt: Nome completo da classe Java. Por exemplo, org.apache.hadoop.examples.Grep

source: Arguments
pt: Argumentos

source: Arguments of the main method. The value of each arg element is considered a single argument and they are passed to the main method in the same order.
pt: Argumentos do método principal. O valor de cada elemento do argumento é considerado um argumento único e pode ser transferido para o método principal pela mesma ordem.

source: Java options
pt: Opções Java

source: Command-line parameters used to start the JVM that will execute the Java application. Using this element is equivalent to using the mapred.child.java.opts configuration property. E.g. -Dexample-property=hue
pt: Parâmetros de linha de comando usados para iniciar a JVM que irá executar a aplicação Java. Utilizar este elemento é equivalente a utilizar a propriedade de configuração mapred.child.java.opts. Por exemplo, -Dexample-property=hue

source: Capture output
pt: Captar saída

source: Capture output of the stdout of the %(program)s command execution. The %(program)s command output must be in Java Properties file format and it must not exceed 2KB. From within the workflow definition, the output of an %(program)s action node is accessible via the String action:output(String node, String key) function
pt: Captar saída do stdout da execução do comando %(program)s. A saída do comando %(program)s tem de estar no formato de ficheiro de Propriedades Java e não pode exceder 2 KB. Na definição de workflows, a saída de um nó de acção %(program)s é acessível através da função String action:output(String node, String key)

source: Script name
pt: Nome do script

source: Script name or path to the Pig script. E.g. my_script.pig.
pt: Nome do script ou caminho para o script Pig. Por exemplo, my_script.pig.

source: Parameters
pt: Parâmetros

source: The Pig parameters of the script. e.g. "-param", "INPUT=${inputDir}"
pt: Parâmetros Pig do script. Por exemplo, "-param", "INPUT=${inputDir}"

source: Script name or path to the %(type)s script. E.g. my_script.sql.
pt: Nome do script ou caminho para o script %(type)s. Por exemplo, my_script.sql.

source: The %(type)s parameters of the script. E.g. N=5, INPUT=${inputDir}
pt: Os parâmetros %(type)s do script. Por exemplo, N=5, INPUT=${inputDir}

source: List of absolute paths to delete, then create, before starting the application. This should be used exclusively for directory cleanup.
pt: Lista de caminhos absolutos a eliminar e depois criar, antes de iniciar a aplicação. Deve ser utilizado exclusivamente para limpeza do directório.

source: Refer to a Hive hive-config.xml file bundled in the workflow deployment directory. Pick a name different than hive-site.xml.
pt: Consulte um ficheiro Hive hive-config.xml no bundle no directório de implementação do workflow. Escolha um nome diferente de hive-site.xml.

source: Command
pt: Comando

source: The full %(type)s command. Either put it here or split it by spaces and insert the parts as multiple parameters below.
pt: O comando %(type)s completo. Coloque-o aqui ou divida-o por espaços e insira em baixo as partes como vários parâmetros.

source: If no command is specified, split the command by spaces and insert the %(type)s parameters here e.g. import, --connect, jdbc:hsqldb:file:db.hsqldb, ...
pt: Se não for especificado nenhum comando, divida o comando por espaços e insira os parâmetros %(type)s aqui, por exemplo, import, --connect, jdbc:hsqldb:file:db.hsqldb, ...

source: List of absolute paths to delete then to create before starting the application. This should be used exclusively for directory cleanup
pt: Lista de caminhos absolutos a eliminar e a criar antes de iniciar a aplicação. Deve ser utilizada exclusivamente para a limpeza de directórios

source: User
pt: Utilizador

source: User executing the shell command.
pt: Utilizador que executa o comando shell.

source: Host
pt: Anfitrião

source: Where the shell will be executed.
pt: Onde a shell é executada.

source: %(type)s command
pt: Comando %(type)s

source: The command that will be executed.
pt: O comando que será executado.

source: The arguments of the %(type)s command.
pt: Os argumentos do comando %(type)s.

source: Capture output of the stdout of the %(program)s command execution. The %(program)s command output must be in Java properties file format and it must not exceed 2KB. From within the workflow definition, the output of an %(program)s action node is accessible via the String action:output(String node, String key) function
pt: Captar saída do stdout da execução do comando %(program)s. A saída do comando %(program)s tem de estar no formato de ficheiro de propriedades Java e não pode exceder 2 KB. Na definição de workflows, a saída de um nó de acção %(program)s é acessível através da função String action:output(String node, String key)

source: The path of the Shell command to execute.
pt: O caminho do comando Shell a executar.

source: The arguments of Shell command can then be specified using one or more argument element.
pt: Argumentos do comando Shell que podem ser especificados utilizando um ou mais elementos de argumentos.

source: The arguments of the %(type)s command. Put options first, then source paths, then destination path.
pt: Argumentos do comando %(type)s. Coloque as opções em primeiro lugar e, em seguida, os caminhos de origem e o caminho de destino.

source: For the job configuration (e.g. mapred.job.queue.name=production
pt: Para a configuração do trabalho (por exemplo, mapred.job.queue.name=production)

source: Delete path
pt: Eliminar caminho

source: Delete the specified path, if it is a directory it deletes recursively all its content and then deletes the directory.
pt: Eliminar o caminho especificado, se é um directório elimina recursivamente todo o conteúdo e, em seguida, elimina o directório.

source: Create directory
pt: Criar directório

source: Create the specified directory, it creates all missing directories in the path. If the directory already exist it does a no-op.
pt: Criar o directório especificado, cria todos os directórios em falta no caminho. Se o directório já existe realiza uma no-op.

source: Move file
pt: Mover ficheiro

source: Move a file or directory to another path.
pt: Mover um ficheiro ou directório para outro caminho.

source: Change permissions
pt: Alterar permissões

source: Change the permissions for the specified path. Permissions can be specified using the Unix Symbolic representation (e.g. -rwxrw-rw-) or an octal representation (755).
pt: Alterar as permissões para o caminho especificado. As permissões podem ser especificadas utilizando a representação simbólica Unix (ex. -rwxrw-rw-) ou uma representação octal (755).

source: Create or touch a file
pt: Criar ou utilizar o comando touch num ficheiro

source: Creates a zero length file in the specified path if none exists or touch it.
pt: Cria um ficheiro de comprimento zero no caminho especificado se não existir nenhum ou utiliza o comando touch.

source: TO addresses
pt: Endereços PARA

source: Comma-separated values.
pt: Valores separados por vírgulas.

source: CC addresses (optional)
pt: Endereços CC (opcional)

source: Subject
pt: Assunto

source: Plain-text.
pt: Texto simples.

source: Body
pt: Corpo

source: The sub-workflow application to include. You must own all the sub-workflows.
pt: A aplicação de sub-workflow a incluir. Deve possuir todos os sub-workflows.

source: Propagate configuration
pt: Propagar configuração

source: If the workflow job configuration should be propagated to the child workflow.
pt: A configuração do trabalho workflow deve ser propagada ao workflow subordinado.

source: Can be used to specify the job properties that are required to run the child workflow job.
pt: Pode ser utilizado para especificar as propriedades do trabalho necessárias para executar o trabalho workflow subordinado.

source: XML of the custom action
pt: XML da acção personalizada

source: This will be inserted verbatim in the action %(action)s. E.g. all the XML content like %(xml_action)s will be inserted into the action and produce %(full_action)s
pt: Será inserido literalmente na acção %(action)s. Por exemplo, todo o conteúdo XML, como %(xml_action)s, será inserido na acção e produzirá %(full_action)s

source: End should not have any children.
pt: Fim não deve ter subordinados.

source: Kill should not have any children.
pt: Eliminar não deve ter subordinados.

source: Minutes
pt: minutos

source: Hours
pt: horas

source: Days
pt: dias

source: Months
pt: meses

source: Frequency number
pt: Número de frequência

source: The number of units of the rate at which data is periodically created.
pt: O número de unidades da taxa em que os dados são criados periodicamente.

source: Frequency unit
pt: Unidade de frequência

source: The unit of the rate at which data is periodically created.
pt: A unidade da taxa em que os dados são criados periodicamente.

source: Timezone
pt: Fuso horário

source: The timezone of the coordinator. Only used for managing the daylight saving time changes when combining several coordinators.
pt: O fuso horário do coordinator. Apenas usado para gestão das alterações do horário de Verão ao combinar vários coordinators.

source: Start
pt: Iniciar

source: When to start the first workflow.
pt: Quando iniciar o primeiro workflow.

source: End
pt: Terminar

source: When to start the last workflow.
pt: Quando iniciar o último workflow.

source: The workflow to schedule repeatedly.
pt: O workflow para programar repetidamente.

source: Timeout
pt: Limite de tempo

source: Number of minutes the coordinator action will be in WAITING or READY status before giving up on its execution.
pt: Número de minutos que a acção do coordinator estará no estado WAITING ou READY antes de desistir da sua execução.

source: Concurrency
pt: Simultaneidade

source: The number of coordinator actions that are allowed to run concurrently (RUNNING status) before the coordinator engine starts throttling them.
pt: O número de acções do coordinator que são permitidas em execução simultânea (estado A EXECUTAR) antes que o mecanismo do coordinator comece a limitá-las.

source: Execution
pt: Execução

source: FIFO (oldest first) default
pt: Predefinição FIFO (primeiro o mais antigo)

source: LIFO (newest first)
pt: LIFO (primeiro o mais recente)

source: LAST_ONLY (discards all older materializations)
pt: LAST_ONLY (elimina todas as materializações mais antigas)

source: Execution strategy of its coordinator actions when there is backlog of coordinator actions in the coordinator engine. The different execution strategies are 'oldest first', 'newest first' and 'last one only'. A backlog normally happens because of delayed input data, concurrency control or because manual re-runs of coordinator jobs.
pt: Estratégia de execução das acções de coordinator quando existe um registo de tarefas pendentes de acções de coordinator no motor do coordinator. As diferentes estratégias de execução são "primeiro o mais antigo", "primeiro o mais recente" e "apenas o último". Normalmente, é gerado um registo de tarefas pendentes devido a dados de entrada atrasados, controlo de simultaneidade ou novas execuções manuais de trabalhos do coordinator.

source: Throttle
pt: Limitação

source: The materialization or creation throttle value for its coordinator actions. Number of maximum coordinator actions that are allowed to be in WAITING state concurrently.
pt: A materialização ou criação do valor de limite para as acções do seu coordinator. Número de acções de coordinator máximas permitidas simultaneamente no estado EM ESPERA.

source: Workflow properties
pt: Propriedades do workflow

source: Additional properties to transmit to the workflow, e.g. limit=100, and EL functions, e.g. username=${coord:user()}
pt: Propriedades adicionais para transmitir ao workflow, por exemplo limite=100, e funções EL, por exemplo, username=${coord:user()}

source: Every 15 minutes
pt: A cada 15 minutos

source: Every 30 minutes
pt: A cada 30 minutos

source: Every hour
pt: A cada hora

source: Every week
pt: A cada semana

source: Every month
pt: A cada mês

source: Every year
pt: A cada ano

source: Permission denied. %(username)s does not have the permissions to access dataset %(id)s.
pt: Permissão negada. %(username)s não possui as permissões para aceder ao conjunto de dados %(id)s.

source: dataset %(id)s not exist
pt: o dataset %(id)s não existe

source: The name of the dataset.
pt: Nome do conjunto de dados.

source: A description of the dataset.
pt: Descrição do conjunto de dados.

source: The UTC datetime of the initial instance of the dataset. The initial instance also provides the baseline datetime to compute instances of the dataset using multiples of the frequency.
pt: Data/hora UTC da instância inicial do conjunto de dados. A instância inicial também fornece a data/hora base para instâncias de cálculo do conjunto de dados utilizando múltiplos da frequência.

source: The URI template that identifies the dataset and can be resolved into concrete URIs to identify a particular dataset instance. The URI consist of constants (e.g. ${YEAR}/${MONTH}) and configuration properties (e.g. /home/${USER}/projects/${PROJECT})
pt: O modelo da URI que identifica o conjunto de dados e pode ser resolvido em URI concretas para identificar uma instância de um conjunto de dados específico. A URI consiste em constantes (por ex. ${YEAR}/${MONTH}) e propriedades de configuração (por ex. /home/${USER}/projects/${PROJECT})

source: The timezone of the dataset. Only used for managing the daylight saving time changes when combining several datasets.
pt: O fuso horário do conjunto de dados. Apenas usado para gestão das alterações do horário de Verão ao combinar vários conjuntos de dados.

source: Done flag
pt: Sinalizador de "concluído"

source: The done file for the data set. If the Done flag is not specified, then Oozie configures Hadoop to create a _SUCCESS file in the output directory. If Done flag is set to empty, then Coordinator looks for the existence of the directory itself.
pt: O ficheiro pronto para o conjunto de dados. Se o sinalizador Concluído não estiver especificado, o Oozie configura o Hadoop para criar um ficheiro _SUCESS no directório de saída. Se o sinalizador Concluído estiver definido para vazio, o Coordinator procura pela existência do próprio directório.

source: The coordinator associated with this data.
pt: Coordinator associado a estes dados.

source: Instance type
pt: Tipo de instância

source: Customize the date instance(s), e.g. define a range of dates, use EL functions...
pt: Personalizar a(s) instância(s) de data(s). Por exemplo, definir um intervalo de datas, utilizar funções EL, etc.

source: Start instance
pt: Instância inicial

source: Shift the frequency for gettting past/future start date or enter verbatim the Oozie start instance, e.g. ${coord:current(0)}
pt: Altera a frequência para obter datas de início passadas/futuras ou introduzir textualmente a instância Oozie inicial, por ex. ${coord:current(0)}

source: End instance
pt: Instância final

source: Optional: Shift the frequency for gettting past/future end dates or enter verbatim the Oozie end instance.
pt: Opcional: mude a frequência de obtenção de datas de fim passadas/futuras ou insira literalmente a instância final de Oozie.

source: Name of an input variable in the workflow.
pt: Nome de uma variável de entrada no workflow.

source: The name of the variable of the workflow to automatically fill up.
pt: Nome da variável do workflow para preenchimento automático.

source: The dataset representing format of the data input.
pt: Conjunto de dados que representa o formato da entrada de dados.

source: The pattern of the input data we want to process.
pt: Padrão dos dados de entrada que pretendemos processar.

source: Name of an output variable in the workflow
pt: Nome de uma variável de saída no workflow

source: The name of the variable of the workflow to automatically filled up.
pt: O nome da variável do workflow a preencher automaticamente.

source: The dataset representing the format of the data output.
pt: Conjunto de dados que representa o formato da saída de dados.

source: The pattern of the output data we want to generate.
pt: Padrão dos dados de saída que pretendemos gerar.

source: The bundle regrouping all the coordinators.
pt: O bundle a reagrupar todos os coordinators.

source: The coordinator to batch with other coordinators.
pt: O coordinator a agrupar com outros coordinators.

source: Constants used at the submission time (e.g. market=US, oozie.use.system.libpath=true).
pt: Parâmetros usados no momento do envio (por exemplo, market=US, oozie.use.system.libpath=true).
