Repository: lockhart39/HueQualityAndIngestionApp
Catalog: apps/oozie/src/oozie/locale/*/LC_MESSAGES/django.po
Languages: pt

source: Save your modifications before creating a new dataset.
pt: Guarde as suas modificações antes de criar um novo dataset.

source: Create dataset
pt: Criar dataset

source: Edit dataset
pt: Editar dataset

source: Save your modifications before editing a dataset.
pt: Guardar as suas modificações antes de editar um dataset.

source: Update dataset
pt: Actualizar dataset

source: Existing datasets
pt: Datasets existentes

source: Click to view the dataset
pt: Clicar para visualizar o dataset

source: There are currently no datasets.
pt: Neste momento, não há datasets.

source: Do you want to create a new dataset ?
pt: Deseja criar um novo dataset ?

source: UTC time only.
pt: Hora UTC apenas.

source: Recommended to be before the coordinator start date.
pt: Recomenda-se que ocorra antes da data de início do coordinator.

source: Edit Workflow
pt: Editar workflow

source: Unsaved
pt: Não guardado

source: Go upload additional files and libraries to the deployment directory on HDFS
pt: Carregar ficheiros e bibliotecas adicionais para o directório de implementação no HDFS

source: Click to import an Oozie workflow action or Job Designer action
pt: Clique para importar uma acção de workflow Oozie ou uma acção de Job Designer

source: Import action
pt: Importar acção

source: Edit kill node
pt: Editar nó de eliminação

source: Kill node
pt: Nó de eliminação

source: Submit this workflow
pt: Enviar este workflow

source: Schedule this workflow
pt: Programar o workflow

source: Copy this workflow
pt: Copiar este workflow

source: Export this workflow
pt: Exportar este workflow

source: Export
pt: Exportar

source: If the "to" field has content, then the workflow editor assumes that the defined email action is to be placed before the kill action.
pt: Se o campo "to" tiver conteúdo, então o editor de workflow assume que a acção de e-mail definida deve ser colocada antes da acção de eliminar.

source: Action enabled:
pt: Acção activada:

source: Import Action from Job Designer
pt: Importar acção de Job Designer

source: Click on a row to import the design as an action in the workflow. The action will be added to the beginning of the flow.
pt: Clique numa linha para importar o design como uma acção no workflow. A acção será adicionada ao início do fluxo.

source: Click to import action to workflow
pt: Clique para importar acção para workflow

source: Import Action from Oozie
pt: Importar acção do Oozie

source: Import Action from Workflow:
pt: Importar acção do Workflow:

source: Click on a row to import the action.
pt: Clique numa fila para importar a acção.

source: Drag and drop this action on the workflow
pt: Arraste e solte esta acção no workflow

source: No actions: drag some from the panel above
pt: Nenhuma acção: arraste algumas do painel acima

source: The workflow has some unsaved changes
pt: O workflow tem algumas alterações não guardadas.

source: Please save or undo your changes before submitting it.
pt: Guarde ou anule as alterações antes de o enviar.

source: Save and submit
pt: Guardar e enviar

source: Convert to Decision
pt: Converter para decisão

source: Received invalid response from server
pt: Reposta inválida recebida do servidor

source: Could not save workflow
pt: Não foi possível guardar o workflow

source: Workflow saved
pt: Workflow guardado

source: Workflow is in read only mode.
pt: Workflow está no modo de apenas leitura.

source: Error loading workflow
pt: Erro ao carregar o workflow

source: Confirm Delete
pt: Confirmar eliminação

source: Are you sure you want to delete
pt: Tem a certeza de que pretende eliminar

source: Action imported at the top of the workflow.
pt: Acção importada no topo do workflow.

source: You have unsaved changes in this workflow.
pt: Tem alterações não guardadas neste workflow.

source: There was a problem copying this workflow.
pt: Ocorreu um problema ao copiar este workflow.

source: There was a problem submitting this workflow.
pt: Ocorreu um problema ao enviar este workflow.

source: Import Coordinator
pt: Importar coordinator

source: You can import an external Oozie coordinator by providing the coordinator definition file.
pt: Pode importar um coordinator Oozie externo ao fornecer o ficheiro de definição de coordinator.

source: Supported coordinator versions are 0.2. Other versions might work depending on their complexity.
pt: As versões de coordinator suportadas são 0.2. Outras versões podem funcionar, dependendo da sua complexidade.

source: Import
pt: Importar

source: Import Workflow
pt: Importar workflow

source: You can import an external Oozie workflow by providing the workflow definition file.
pt: Pode importar um workflow Oozie externo ao fornecer um ficheiro de definição de workflow.

source: Supported workflow versions are 0.4. Other versions might work depending on their complexity.
pt: As versões de workflow suportadas são 0.4. Outras versões podem funcionar dependendo da sua complexidade.

source: Bundle Manager
pt: Gestor do bundle

source: Search for name, description, etc...
pt: Pesquisar por nome, descrição, etc...

source: Move to trash
pt: Mover para o lixo

source: Delete forever
pt: Eliminar permanentemente

source: Create
pt: Criar

source: View trash
pt: Ver o lixo

source: Kick off
pt: Início

source: Move the selected bundle(s) to trash?
pt: Mover os bundles seleccionados para o lixo?

source: Delete the selected bundle(s)?
pt: Excluir os bundles seleccionados?

source: Showing _START_ to _END_ of _TOTAL_ entries
pt: A mostrar _START_ a _END_ de _TOTAL_ entradas

source: Showing 0 to 0 of 0 entries
pt: A mostrar 0 a 0 de 0 entradas

source: (filtered from _MAX_ total entries)
pt: (filtradas de um total de _MAX_ entradas)

source: First
pt: Primeiro

source: Coordinator Manager
pt: Gestor do coordinator

source: Move the selected coordinator(s) to trash?
pt: Mover os coordinators seleccionados para o lixo?

source: Delete the selected coordinator(s)?
pt: Eliminar o(s) coordinator(s) seleccionado(s)?

source: Submission History
pt: Histórico de envios

source: Submission Date
pt: Data de envio

source: Submission Id
pt: ID de envio

source: History Record
pt: Registo de histórico

source: Trashed Bundles
pt: Bundles enviados para o lixo

source: Bundle Trash
pt: Lixo de bundles

source: Retore the selected bundles
pt: Restaurar os bundles seleccionados?

source: Restore
pt: Restaurar

source: Delete the selected bundles
pt: Eliminar os bundles seleccionados

source: Delete all the bundles
pt: Eliminar todos os bundles

source: Empty trash
pt: Esvaziar lixo

source: Got to bundle manager
pt: Ir para o gestor de bundle

source: Delete all bundle(s)?
pt: Eliminar todos os bundles?

source: Restore the selected bundle(s)?
pt: Restaurar o(s) bundle(s) seleccionado(s)?

source: Trashed Coordinators
pt: Coordinators no lixo

source: Coordinator Trash
pt: Lixo de coordinators

source: Restore the selected coordinators
pt: Restaurar os coordinators seleccionados

source: Delete the selected coordinators
pt: Eliminar os coordinators seleccionados

source: Got to coordinator manager
pt: Ir para o gestor de coordinators

source: Delete all coordinator(s)?
pt: Eliminar todos os coordinators?

source: Restore the selected coordinator(s)?
pt: Restaurar o(s) coordinator(s) seleccionados?

source: Trashed Workflows
pt: Workflows no lixo

source: Workflow Trash
pt: Lixo de workflow

source: Restore the selected workflows
pt: Restaurar os workflows seleccionados

source: Delete the selected workflows
pt: Eliminar os workflows seleccionados

source: Delete all the workflows
pt: Eliminar todos os workflows

source: Go to workflow manager
pt: Ir para gestor de workflow

source: Steps
pt: Passos

source: Delete the selected workflow(s)?
pt: Eliminar o(s) workflow(s) seleccionado(s)?

source: Delete all trashed workflow(s)?
pt: Eliminar todos os workflows no lixo?

source: Restore the selected workflow(s)?
pt: Restaurar o(s) workflow(s) seleccionados?

source: Workflow Manager
pt: Gestor de workflows

source: Trash
pt: Lixo

source: Move the selected workflow(s) to trash?
pt: Mover o(s) workflow(s) seleccionados para o lixo?

source: Submit this job?
pt: Enviar este job?

source: View workflow action
pt: Acção de visualizar workflow

source: Bundle Editor
pt: Editor do bundle

source: Settings
pt: Definições

source: Saving...
pt: A guardar...

source: New
pt: Novo

source: Which schedules to bundle?
pt: Criar bundle a partir de que agendas?

source: Add a coordinator
pt: Adicionar um coordinator

source: Open
pt: Abrir

source: Add a parameter
pt: Adicionar um parâmetro

source: Filter coordinators
pt: Filtrar coordinators

source: There are no coordinators matching your search term.
pt: Nenhum coordinator corresponde ao seu termo de pesquisa.

source: Submission Parameters
pt: Parâmetros de envio

source: Add parameter
pt: Adicionar parâmetro

source: Choose a file
pt: Escolha um ficheiro

source: Now
pt: Agora

source: Which workflow to schedule?
pt: Que workflow agendar?

source: Choose a workflow...
pt: Seleccione um workflow...

source: How often?
pt: Com que frequência?

source: Options
pt: Opções

source: Hide
pt: Ocultar

source: Advanced syntax
pt: Sintaxe avançada

source: From
pt: De

source: To
pt: Para

source: Parameter
pt: Parâmetro

source: Input Path
pt: Caminho de entrada

source: Output Path
pt: Caminho de saída

source: Will convert to
pt: Será convertido para

source: Same frequency
pt: A mesma frequência

source: Same start
pt: O mesmo início

source: Same timezone
pt: O mesmo fuso horário

source: Filter workflows
pt: Filtrar workflows

source: There are no workflows matching your search term.
pt: Nenhum workflow corresponde ao seu termo de pesquisa.

source: Coordinator Settings
pt: Definições do coordinator

source: FIFO (oldest first)
pt: FIFO (o mais antigo primeiro)

source: This workflow was imported from an old Hue version, save it to create a copy in the new format or
pt: Este workflow foi importado de uma versão antiga do Hue. Guarde-o para criar uma cópia no novo formato ou

source: open it in the old editor.
pt: abra-o no editor antigo.

source: Drop your action here
pt: Solte a sua acção aqui

source: Move node
pt: Mover nó

source: Copy node
pt: Copiar nó

source: Click for more
pt: Clique para mais

source: Click for more info
pt: Clique para obter mais informação

source: If
pt: Se

source: Jump to another node
pt: Avance para outro nó

source: It is where we finish if failure!
pt: É onde terminamos em caso de falha!

source: It is where we start!
pt: É onde começamos!

source: It is where we successfully finish!
pt: É onde terminamos com sucesso!

source: Directory
pt: Directório

source: name, e.g. mapred.job.queue.name
pt: nome, por exemplo mapred.job.queue.name

source: No properties defined.
pt: Nenhuma propriedade definida.

source: No archives defined.
pt: Nenhum arquivo definido.

source: No arguments defined.
pt: Nenhum argumento definido.

source: No available credentials.
pt: Sem credenciais disponíveis.

source: Transitions
pt: Transições

source: to
pt: para

source: Source path
pt: Caminho de fonte

source: New destination path
pt: Novo caminho de destino

source: Only for directories
pt: Apenas para directórios

source: Recursive to sub directories
pt: Recursivo para subdirectórios

source: e.g. newgroup
pt: por exemplo newgroup

source: About
pt: Sobre

source: Share
pt: Partilhar

source: Workflow Editor
pt: Editor de workflow

source: Submit %(job)s?
pt: Enviar %(job)s?

source: ACTIONS
pt: ACÇÕES

source: Hive Script
pt: Script do Hive

source: HiveServer2 Script
pt: Script do HiveServer2

source: Pig Script
pt: Script Pig

source: MapReduce job
pt: Job MapReduce

source: e.g. ${nameNode1}/path/to/input.txt
pt: por exemplo ${nameNode1}/path/to/input.txt

source: e.g. ${nameNode2}/path/to/output.txt
pt: por exemplo ${nameNode2}/path/to/output.txt

source: Workflow Settings
pt: Definições de workflow

source: Toggle arrow showing
pt: Mostrar seta de alternar

source: Could not find node of type
pt: Não foi possível encontrar nó de tipo

source: links must be a list
pt: as ligações devem ser uma lista

source: Start should have two children: 'related' to end, 'to' to any node but an end.
pt: Início deve ter dois elementos subordinados: "related" para final e "to" para qualquer nó excepto final.

source: End should have no children.
pt: Final não deve ter elementos subordinados.

source: Kill should have no children.
pt: Eliminar não deve ter elementos subordinados.

source: Join and Decision End should have one child: 'to' to any node.
pt: Unir e Final de decisão deve ter um elemento subordinado: "to" para qualquer nó.

source: Fork and Decision should have at least two children: 'related' to their respective ends, 'start' to any node.
pt: Bifurcação e Decisão têm de ter no mínimo dois elementos subordinados: "related" para os respectivos finais e "start" para qualquer nó.

source: Actions should have two children: 'error' to kill, 'ok' to any node.
pt: Acções devem ter dois elementos subordinados: "error" para eliminar e "ok" para qualquer nó.

source: %(node_type)s should have %(count)d more %(link_type)s linknode_type
pt: %(node_type)s deve ter %(count)d mais %(link_type)s linknode_type

source: Error saving workflow
pt: Erro ao guardar workflow

source: Must be POST request.
pt: Tem de ser um pedido POST.

source: Must be GET request.
pt: Deve ser pedido GET.

source: Use a POST request to manage an Oozie job.
pt: Utilize um pedido POST para gerir um trabalho Oozie.

source: Use a POST request to manage the Oozie jobs.
pt: Use um pedido POST para gerir um job de Oozie.

source: The Oozie server is not running
pt: O servidor Oozie não está em execução

source: An error occurred with Oozie.
pt: Ocorreu um erro com o Oozie.

source: Error accessing Oozie action %s.
pt: Erro ao aceder à acção do Oozie %s.

source: Invalid submission form: %s
pt: Formulário de envio inválido: %s

source: Workflow re-running.
pt: A executar workflow novamente.

source: Invalid submission form: %s %s
pt: Formulário de envio inválido: %s %s

source: Error re-running workflow %s.
pt: Erro ao executar novamente o workflow %s.

source: Coordinator re-running.
pt: A executar novamente o coordinator.

source: Error re-running coordinator %s.
pt: Erro ao executar novamente o coordinator %s.

source: Bundle re-running.
pt: A executar novamente o bundle.

source: Error re-running bundle %s.
pt: Erro ao executar novamente o bundle %s.

source: Error submitting job %s
pt: Erro ao enviar o job %s

source: Oozie job submitted
pt: Job do Oozie enviado

source: Error accessing Oozie job %s.
pt: Erro ao aceder ao job do Oozie %s.

source: Permission denied. %(username)s does not have the permissions to access job %(id)s.
pt: Permissão negada. O %(username)s não possui permissões para aceder ao job %(id)s.

source: Permission denied. %(username)s does not have the permissions to modify job %(id)s.
pt: Permissão negada. O %(username)s não possui permissões para modificar o job %(id)s.

source: Archive should be a Zip.
pt: O arquivo deve ser um Zip.

source: Workflow imported
pt: Workflow importado

source: Could not import workflow: %s
pt: Não foi possível importar o workflow: %s

source: Could not import workflow.
pt: Não foi possível importar o workflow.

source: Errors on the form: %s
pt: Erros no formulário: %s

source: Could not import coordinator: %s
pt: Não foi possível importar o coordinator: %s

source: Could not import coordinator.
pt: Não foi possível importar o coordinator.

source: Coordinator imported
pt: Coordinator importado

source: Errors on the form
pt: Erros no formulário

source: A POST request is required.
pt: É necessário um pedido POST.

source: Workflow(s) deleted.
pt: Workflow(s) eliminado(s).

source: Workflow(s) trashed.
pt: Workflow(s) no lixo.

source: Workflow(s) restored.
pt: Workflow(s) restaurado(s).

source: Workflow submitted
pt: Workflow enviado

source: Error submitting workflow %s
pt: Erro ao enviar workflow %s

source: You already have some coordinators for this workflow. Submit one or create a new one.
pt: Já tem alguns coordinators para este workflow. Enviar um ou criar um novo.

source: Coordinator(s) deleted.
pt: Coordinator(s) eliminado(s).

source: Coordinator(s) trashed.
pt: Coordinator(s) no lixo.

source: Coordinator(s) restored.
pt: Coordinator(s) restaurado(s).

source: Coordinator saved.
pt: Coordinator guardado.

source: Dataset created
pt: Dataset criado

source: Dataset modified
pt: Dataset modificado

source: Beware: dataset start date was after the coordinator start date.
pt: Atenção: a data de início do dataset foi posterior à data de início do coordinator.

source: Coordinator data created
pt: Dados do coordinator criados

source: Coordinator submitted.
pt: Coordinator enviado.

source: Error submitting coordinator %s
pt: Erro ao enviar o coordinator %s

source: Bundle(s) deleted.
pt: Bundle(s) eliminado(s).

source: Bundle(s) restored.
pt: Bundle(s) restaurado(s).

source: Bundle saved.
pt: Bundle guardado.

source: Coordinator added to the bundle!
pt: Coordinator adicionado ao bundle!

source: Bundled coordinator updated!
pt: Coordinator no bundle actualizado!

source: Bundle submitted.
pt: Bundle enviado.

source: Error submitting bundle %s
pt: Erro ao enviar o bundle %s

source: Document deleted.
pt: Documento eliminado.

source: Workflows copied.
pt: Workflows copiados.

source: Workflow copied.
pt: Workflow copiado.

source: Page saved !
pt: Página guardada!

source: You don't have access to the workflow of this coordinator.
pt: Não tem acesso ao workflow deste coordinator.

source: Coordinator copied.
pt: Coordinator copiado.

source: Saved !
pt: Guardado!

source: Bundle copied.
pt: Bundle copiado.
