Repository: lockhart39/HueQualityAndIngestionApp
Catalog: desktop/libs/hadoop/src/hadoop/locale/*/LC_MESSAGES/django.po
Languages: pt_br

source: NameNode logical name.
pt_br: Nome lógico NameNode.

source: JobTracker logical name.
pt_br: Nome lógico JobTracker.

source: Resource Manager logical name.
pt_br: Nome lógico do Resource Manager.

source: %(remote_dst)s already exists. Skipping.
pt_br: %(remote_dst)s já existe. Ignorando.

source: %(remote_dst)s does not exist. Trying to copy.
pt_br: %(remote_dst)s não existe. Tentando copiar.

source: Copied %s -> %s.
pt_br: %s -> %s copiado.

source: Copying %s -> %s failed.
pt_br: Falha na cópia %s -> %s.

source: Skipping %s (not a file).
pt_br: Ignorando %s (não é um arquivo).

source: %(function)s has not been implemented.
pt_br: %(function)s não foi implementada.

source: File %s not found
pt_br: Arquivo %s não encontrado

source: File %s is a directory
pt_br: O arquivo %s é um diretório

source: File %s is already trashed
pt_br: O arquivo %s já está na lixeira

source: Delete failed: %s
pt_br: Falha ao excluir: %s

source: File %s is not in trash
pt_br: O arquivo %s não está na lixeira

source: Path %s already exists.
pt_br: O caminho %s já existe.

source: Mkdir failed: %s
pt_br: Falha de mkdir: %s

source: Rename failed: %s -> %s
pt_br: Falha ao renomear: %s -> %s

source: '%s' is not a directory
pt_br: '%s' não é um diretório

source: Copy src '%s' does not exist
pt_br: Src de cópia '%s' não existe

source: Copy src '%s' is a directory
pt_br: Src de cópia '%s' é um diretório

source: Copy dst '%s' is a directory
pt_br: Dst de cópia '%s' é um diretório

source: File not found: %s
pt_br: Arquivo não encontrado: %s

source: Destination file %s exists and is not a directory.
pt_br: O arquivo de destino %s existe e não é um diretório.

source: Failed to create '%s'. HDFS did not return a redirect
pt_br: Falha ao criar '%s'. HDFS não retornou um redirecionamento

source: Is a directory: '%s'
pt_br: É um diretório: '%s'

source: Invalid argument to seek for whence
pt_br: Argumento inválido para buscar whence

source: File not open for writing
pt_br: Arquivo não aberto para gravação

source: Failed to access filesystem root
pt_br: Falha ao acessar raiz do sistema de arquivos

source: Failed to create temporary file "%s"
pt_br: Falha ao criar arquivo temporário "%s"

source: Failed to remove temporary file "%s"
pt_br: Falha ao remover arquivo temporário "%s"

source: No Resource Manager are available.
pt_br: Nenhum Resource Manager disponível.
